<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>ca</title>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rev="made" href="mailto:root@localhost" />
</head>

<body>



<ul id="index">
  <li><a href="#NAME">NAME</a></li>
  <li><a href="#SYNOPSIS">SYNOPSIS</a></li>
  <li><a href="#DESCRIPTION">DESCRIPTION</a></li>
  <li><a href="#OPTIONS">OPTIONS</a></li>
  <li><a href="#CRL-OPTIONS">CRL OPTIONS</a></li>
  <li><a href="#CONFIGURATION-FILE-OPTIONS">CONFIGURATION FILE OPTIONS</a></li>
  <li><a href="#POLICY-FORMAT">POLICY FORMAT</a></li>
  <li><a href="#SPKAC-FORMAT">SPKAC FORMAT</a></li>
  <li><a href="#EXAMPLES">EXAMPLES</a></li>
  <li><a href="#FILES">FILES</a></li>
  <li><a href="#ENVIRONMENT-VARIABLES">ENVIRONMENT VARIABLES</a></li>
  <li><a href="#RESTRICTIONS">RESTRICTIONS</a></li>
  <li><a href="#BUGS">BUGS</a></li>
  <li><a href="#WARNINGS">WARNINGS</a></li>
  <li><a href="#SEE-ALSO">SEE ALSO</a></li>
  <li><a href="#COPYRIGHT">COPYRIGHT</a></li>
</ul>

<h1 id="NAME">NAME</h1>

<p>ca - sample minimal CA application</p>

<h1 id="SYNOPSIS">SYNOPSIS</h1>

<p><b>gmssl</b> <b>ca</b> [<b>-help</b>] [<b>-verbose</b>] [<b>-config filename</b>] [<b>-name section</b>] [<b>-gencrl</b>] [<b>-revoke file</b>] [<b>-valid file</b>] [<b>-status serial</b>] [<b>-updatedb</b>] [<b>-crl_reason reason</b>] [<b>-crl_hold instruction</b>] [<b>-crl_compromise time</b>] [<b>-crl_CA_compromise time</b>] [<b>-crldays days</b>] [<b>-crlhours hours</b>] [<b>-crlexts section</b>] [<b>-startdate date</b>] [<b>-enddate date</b>] [<b>-days arg</b>] [<b>-md arg</b>] [<b>-policy arg</b>] [<b>-keyfile arg</b>] [<b>-keyform PEM|DER</b>] [<b>-key arg</b>] [<b>-passin arg</b>] [<b>-cert file</b>] [<b>-selfsign</b>] [<b>-in file</b>] [<b>-out file</b>] [<b>-notext</b>] [<b>-outdir dir</b>] [<b>-infiles</b>] [<b>-spkac file</b>] [<b>-ss_cert file</b>] [<b>-preserveDN</b>] [<b>-noemailDN</b>] [<b>-batch</b>] [<b>-msie_hack</b>] [<b>-extensions section</b>] [<b>-extfile section</b>] [<b>-engine id</b>] [<b>-subj arg</b>] [<b>-utf8</b>] [<b>-create_serial</b>] [<b>-multivalue-rdn</b>]</p>

<h1 id="DESCRIPTION">DESCRIPTION</h1>

<p>The <b>ca</b> command is a minimal CA application. It can be used to sign certificate requests in a variety of forms and generate CRLs it also maintains a text database of issued certificates and their status.</p>

<p>The options descriptions will be divided into each purpose.</p>

<p>ca&#x6307;&#x4EE4;&#x662F;CA&#x4E2D;&#x5F88;&#x5C0F;&#x7684;&#x5E94;&#x7528;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x7B7E;&#x53D1;&#x5404;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x7528;&#x6237;&#x8BC1;&#x4E66;&#x5E76;&#x4EA7;&#x751F;CRL&#x3002;&#x5B83;&#x8FD8;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x66F4;&#x65B0;&#x8BC1;&#x4E66;&#x5E93;&#x3002; &#x5728;&#x8FD9;&#x4E9B;&#x6307;&#x4EE4;&#x7684;&#x4ECB;&#x7ECD;&#x4E2D;&#xFF0C;&#x5C06;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x4ECB;&#x7ECD;&#x3002;</p>

<h1 id="OPTIONS">OPTIONS</h1>

<dl>

<dt id="help"><b>-help</b></dt>
<dd>

<p>Print out a usage message.</p>

<p>&#x663E;&#x793A;&#x7528;&#x6CD5;&#x4FE1;&#x606F;&#x3002;</p>

</dd>
<dt id="verbose"><b>-verbose</b></dt>
<dd>

<p>this prints extra details about the operations being performed.</p>

<p>&#x8F93;&#x51FA;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;&#x8FC7;&#x7A0B;&#x4FE1;&#x606F;&#x3002;</p>

</dd>
<dt id="config-filename"><b>-config filename</b></dt>
<dd>

<p>specifies the configuration file to use.</p>

<p>&#x6307;&#x5B9A;&#x5C06;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;</p>

</dd>
<dt id="name-section"><b>-name section</b></dt>
<dd>

<p>specifies the configuration file section to use (overrides <b>default_ca</b> in the <b>ca</b> section).</p>

<p>&#x6307;&#x5B9A;&#x5C06;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x90E8;&#x5206;&#xFF08;&#x8986;&#x76D6;ca&#x90E8;&#x5206;&#x4E2D;&#x7684;default_ca&#x90E8;&#x5206;&#xFF09;</p>

</dd>
<dt id="in-filename"><b>-in filename</b></dt>
<dd>

<p>an input filename containing a single certificate request to be signed by the CA.</p>

<p>&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x540D;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E2A;&#x8981;&#x7531;CA&#x7B7E;&#x540D;&#x7684;&#x5355;&#x72EC;&#x8BC1;&#x4E66;&#x8BF7;&#x6C42;&#x3002;</p>

</dd>
<dt id="ss_cert-filename"><b>-ss_cert filename</b></dt>
<dd>

<p>a single self-signed certificate to be signed by the CA.</p>

<p>&#x4E00;&#x4E2A;&#x8981;&#x7531;CA&#x7B7E;&#x540D;&#x7684;&#x81EA;&#x7B7E;&#x540D;&#x8BC1;&#x4E66;&#x3002;</p>

</dd>
<dt id="spkac-filename"><b>-spkac filename</b></dt>
<dd>

<p>a file containing a single Netscape signed public key and challenge and additional field values to be signed by the CA. See the <b>SPKAC FORMAT</b> section for information on the required input and output format.</p>

<p>&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;Netscape&#x7B7E;&#x540D;&#x7684;&#x516C;&#x94A5;&#x548C;&#x5176;&#x4ED6;&#x9644;&#x52A0;&#x7528;&#x6237;&#x4FE1;&#x606F;&#x3002; &#x5173;&#x4E8E;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x683C;&#x5F0F;&#x7684;&#x4FE1;&#x606F;&#x5177;&#x4F53;&#x53EF;&#x4EE5;&#x53C2;&#x8003;SPKAC&#x90E8;&#x5206;&#x3002;</p>

</dd>
<dt id="infiles"><b>-infiles</b></dt>
<dd>

<p>if present this should be the last option, all subsequent arguments are taken as the names of files containing certificate requests.</p>

<p>&#x8BE5;&#x9009;&#x9879;&#x603B;&#x662F;&#x4F5C;&#x4E3A;&#x6307;&#x4EE4;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x9009;&#x9879;&#xFF0C;&#x5176;&#x540E;&#x9762;&#x6240;&#x6709;&#x7684;&#x53C2;&#x6570;&#x90FD;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x8BC1;&#x4E66;&#x8BF7;&#x6C42;&#x6587;&#x4EF6;&#x3002;</p>

</dd>
<dt id="out-filename"><b>-out filename</b></dt>
<dd>

<p>the output file to output certificates to. The default is standard output. The certificate details will also be printed out to this file in PEM format (except that <b>-spkac</b> outputs DER format).</p>

<p>&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#x8F93;&#x51FA;&#x7B7E;&#x53D1;&#x597D;&#x7684;&#x8BC1;&#x4E66;&#x3002;&#x9ED8;&#x8BA4;&#x503C;&#x4E3A;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#x3002;&#x8F93;&#x51FA;&#x7684;&#x8BC1;&#x4E66;&#x90FD;&#x662F;PEM&#x7F16;&#x7801;&#x7684;&#xFF08;&#x9664;&#x4E86;spkac&#x8F93;&#x51FA;DER&#x7F16;&#x7801;&#xFF09;</p>

</dd>
<dt id="outdir-directory"><b>-outdir directory</b></dt>
<dd>

<p>the directory to output certificates to. The certificate will be written to a filename consisting of the serial number in hex with &quot;.pem&quot; appended.</p>

<p>&#x5C06;&#x65B0;&#x751F;&#x6210;&#x7684;&#x8BC1;&#x4E66;&#x8F93;&#x51FA;&#x5230;&#x76EE;&#x5F55;&#x3002;&#x65B0;&#x751F;&#x6210;&#x8BC1;&#x4E66;&#x5C06;&#x4F1A;&#x5E8F;&#x5217;&#x53F7;&#x52A0;&ldquo;pem&rdquo;&#x540E;&#x7F00;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x8BC1;&#x4E66;&#x6587;&#x4EF6;&#x540D;&#x3002;</p>

</dd>
<dt id="cert"><b>-cert</b></dt>
<dd>

<p>the CA certificate file.</p>

<p>CA&#x8BC1;&#x4E66;&#x6587;&#x4EF6;&#x3002;</p>

</dd>
<dt id="keyfile-filename"><b>-keyfile filename</b></dt>
<dd>

<p>the private key to sign requests with.</p>

<p>&#x7528;&#x4E8E;&#x7B7E;&#x7F72;&#x8BF7;&#x6C42;&#x7684;&#x79C1;&#x94A5;&#x3002;</p>

</dd>
<dt id="keyform-PEM-DER"><b>-keyform PEM|DER</b></dt>
<dd>

<p>the format of the data in the private key file. The default is PEM.</p>

<p>&#x79C1;&#x94A5;&#x6587;&#x4EF6;&#x4E2D;&#x6570;&#x636E;&#x7684;&#x683C;&#x5F0F;&#x3002;&#x9ED8;&#x8BA4;&#x4E3A;PEM&#x3002;</p>

</dd>
<dt id="key-password"><b>-key password</b></dt>
<dd>

<p>the password used to encrypt the private key. Since on some systems the command line arguments are visible (e.g. Unix with the &#39;ps&#39; utility) this option should be used with caution.</p>

<p>&#x7528;&#x4E8E;&#x52A0;&#x5BC6;&#x79C1;&#x94A5;&#x7684;&#x5BC6;&#x7801;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x67D0;&#x4E9B;&#x7CFB;&#x7EDF;&#x4E0A;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x662F;&#x53EF;&#x89C1;&#x7684;&#xFF08;&#x4F8B;&#x5982;&#x4F7F;&#x7528;&ldquo;ps&rdquo;&#x5B9E;&#x7528;&#x7A0B;&#x5E8F;&#x7684;Unix&#xFF09;&#xFF0C;&#x5E94;&#x8C28;&#x614E;&#x4F7F;&#x7528;&#x6B64;&#x6307;&#x4EE4;&#x3002;</p>

</dd>
<dt id="selfsign"><b>-selfsign</b></dt>
<dd>

<p>indicates the issued certificates are to be signed with the key the certificate requests were signed with (given with <b>-keyfile</b>). Certificate requests signed with a different key are ignored. If <b>-spkac</b>, <b>-ss_cert</b> or <b>-gencrl</b> are given, <b>-selfsign</b> is ignored.</p>

<p>A consequence of using <b>-selfsign</b> is that the self-signed certificate appears among the entries in the certificate database (see the configuration option <b>database</b>), and uses the same serial number counter as all other certificates sign with the self-signed certificate.</p>

<p>&#x8868;&#x793A;&#x53D1;&#x51FA;&#x7684;&#x8BC1;&#x4E66;&#x5C06;&#x4F7F;&#x7528;&#x8BC1;&#x4E66;&#x8BF7;&#x6C42;&#x7B7E;&#x540D;&#x7684;&#x5BC6;&#x94A5;&#xFF08;&#x4EE5;-keyfile&#x547D;&#x540D;&#xFF09;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#x3002; &#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x5BC6;&#x94A5;&#x7B7E;&#x540D;&#x7684;&#x8BC1;&#x4E66;&#x8BF7;&#x6C42;&#x5C06;&#x88AB;&#x5FFD;&#x7565;&#x3002;&#x5982;&#x679C;&#x7ED9;&#x51FA;-spkac&#xFF0C;-ss_cert&#x6216;-gencrl&#xFF0C;&#x5219;&#x5FFD;&#x7565;-selfsign</p>

<p>&#x4F7F;&#x7528;-selfsign&#x7684;&#x7ED3;&#x679C;&#x662F;&#x81EA;&#x7B7E;&#x540D;&#x8BC1;&#x4E66;&#x51FA;&#x73B0;&#x5728;&#x8BC1;&#x4E66;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6761;&#x76EE;&#x4E2D;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x4E0E;&#x5176;&#x4ED6;&#x8BC1;&#x4E66;&#x76F8;&#x540C;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#x8BA1;&#x6570;&#x5668;&#x3002;</p>

</dd>
<dt id="passin-arg"><b>-passin arg</b></dt>
<dd>

<p>the key password source. For more information about the format of <b>arg</b> see the <b>PASS PHRASE ARGUMENTS</b> section in <a href="../man1/gmssl.html">gmssl(1)</a>.</p>

<p>&#x7ED9;&#x5B9A;&#x4E86;&#x8BFB;&#x53D6;&#x79C1;&#x94A5;&#x6587;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x7684;&#x53E3;&#x4EE4;&#x3002;</p>

</dd>
<dt id="notext"><b>-notext</b></dt>
<dd>

<p>don&#39;t output the text form of a certificate to the output file.</p>

<p>&#x4E0D;&#x628A;&#x8BC1;&#x4E66;&#x7684;&#x6587;&#x672C;&#x5F62;&#x5F0F;&#x8F93;&#x51FA;&#x5230;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#x3002;</p>

</dd>
<dt id="startdate-date"><b>-startdate date</b></dt>
<dd>

<p>this allows the start date to be explicitly set. The format of the date is YYMMDDHHMMSSZ (the same as an ASN1 UTCTime structure).</p>

<p>&#x8BBE;&#x7F6E;&#x8BC1;&#x4E66;&#x7684;&#x751F;&#x6548;&#x65F6;&#x95F4;&#xFF0C;&#x5176;&#x53C2;&#x6570;&#x683C;&#x5F0F;&#x662F;&ldquo;YYMMDDHHMMSSZ&rdquo;&#x3002;</p>

</dd>
<dt id="enddate-date"><b>-enddate date</b></dt>
<dd>

<p>this allows the expiry date to be explicitly set. The format of the date is YYMMDDHHMMSSZ (the same as an ASN1 UTCTime structure).</p>

<p>&#x8BBE;&#x7F6E;&#x8BC1;&#x4E66;&#x7684;&#x5230;&#x671F;&#x65F6;&#x95F4;&#xFF0C;&#x5176;&#x53C2;&#x6570;&#x683C;&#x5F0F;&#x662F;&ldquo;YYMMDDHHMMSSZ&rdquo;&#x3002;</p>

</dd>
<dt id="days-arg"><b>-days arg</b></dt>
<dd>

<p>the number of days to certify the certificate for.</p>

<p>&#x8BBE;&#x7F6E;&#x8BC1;&#x4E66;&#x7684;&#x6709;&#x6548;&#x5929;&#x6570;&#x3002;</p>

</dd>
<dt id="md-alg"><b>-md alg</b></dt>
<dd>

<p>the message digest to use. Any digest supported by the GmSSL <b>dgst</b> command can be used. This option also applies to CRLs.</p>

<p>&#x6D88;&#x606F;&#x6458;&#x8981;&#x4F7F;&#x7528;&#x3002; &#x53EF;&#x4EE5;&#x4F7F;&#x7528;GmSSL dgst&#x547D;&#x4EE4;&#x652F;&#x6301;&#x7684;&#x4EFB;&#x4F55;&#x6458;&#x8981;&#x3002; &#x8BE5;&#x9009;&#x9879;&#x4E5F;&#x9002;&#x7528;&#x4E8E;CRLs&#x3002;</p>

</dd>
<dt id="policy-arg"><b>-policy arg</b></dt>
<dd>

<p>this option defines the CA &quot;policy&quot; to use. This is a section in the configuration file which decides which fields should be mandatory or match the CA certificate. Check out the <b>POLICY FORMAT</b> section for more information.</p>

<p>&#x8BE5;&#x9009;&#x9879;&#x5B9A;&#x4E49;&#x4E86;CA&#x7684;&#x5339;&#x914D;&#x7B56;&#x7565;&#x3002;&#x8FD9;&#x662F;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5B83;&#x51B3;&#x5B9A;&#x4E86;&#x54EA;&#x4E9B;&#x5B57;&#x6BB5;&#x5E94;&#x8BE5;&#x662F;&#x5FC5;&#x987B;&#x7684; &#x6216;&#x4E0E;CA&#x8BC1;&#x4E66;&#x5339;&#x914D;&#x3002;&#x67E5;&#x770B;policy format&#x90E8;&#x5206;&#x6765;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x3002;</p>

</dd>
<dt id="msie_hack"><b>-msie_hack</b></dt>
<dd>

<p>this is a legacy option to make <b>ca</b> work with very old versions of the IE certificate enrollment control &quot;certenr3&quot;. It used UniversalStrings for almost everything. Since the old control has various security bugs its use is strongly discouraged. The newer control &quot;Xenroll&quot; does not need this option.</p>

<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x9057;&#x7559;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x4F7F;ca&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x975E;&#x5E38;&#x8001;&#x7684;ie&#x8BC1;&#x4E66;&#x6CE8;&#x518C;&#x63A7;&#x4EF6;centenr3.&#x5B83;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x4E1C;&#x897F; &#x90FD;&#x4F7F;&#x7528;&#x4E86;UniversalStrings&#x3002;&#x6211;&#x4EEC;&#x975E;&#x5E38;&#x4E0D;&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x65E7;&#x7248;&#x63A7;&#x4EF6;&#x5E94;&#x4E3A;&#x5B83;&#x6709;&#x5F88;&#x591A;&#x7684;&#x5B89;&#x5168;&#x6F0F;&#x6D1E;&#x3002;&#x65B0;&#x7684;&#x63A7;&#x4EF6; Xenroll&#x4E0D;&#x9700;&#x8981;&#x8FD9;&#x4E00;&#x9879;&#x3002;</p>

</dd>
<dt id="preserveDN"><b>-preserveDN</b></dt>
<dd>

<p>Normally the DN order of a certificate is the same as the order of the fields in the relevant policy section. When this option is set the order is the same as the request. This is largely for compatibility with the older IE enrollment control which would only accept certificates if their DNs match the order of the request. This is not needed for Xenroll.</p>

<p>&#x4F7F;&#x6307;&#x4EE4;&#x5728;&#x7B7E;&#x53D1;&#x8BC1;&#x4E66;&#x7684;&#x65F6;&#x5019;&#x8BA9;&#x8BC1;&#x4E66;&#x4E3B;&#x4F53;&#x540D;&#x79F0;&#x5185;&#x7684;&#x5404;&#x9879;&#x5185;&#x5BB9;&#x987A;&#x5E8F;&#x8DDF;&#x8BC1;&#x4E66;&#x8BF7;&#x6C42;&#x4E2D;&#x7684;&#x987A;&#x5E8F;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002; &#x800C;&#x5728;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BC1;&#x4E66;&#x4E3B;&#x9898;&#x540D;&#x79F0;&#x5185;&#x7684;&#x5404;&#x4E2A;&#x9009;&#x9879;&#x987A;&#x5E8F;&#x662F;&#x6309;&#x7167;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x8BC1;&#x4E66;&#x5339;&#x914D;&#x7B56;&#x7565;&#x5B50;&#x6BB5;&#x7684; &#x9009;&#x9879;&#x987A;&#x5E8F;&#x8FDB;&#x884C;&#x6392;&#x5217;&#x7684;&#x3002;</p>

</dd>
<dt id="noemailDN"><b>-noemailDN</b></dt>
<dd>

<p>The DN of a certificate can contain the EMAIL field if present in the request DN, however it is good policy just having the e-mail set into the altName extension of the certificate. When this option is set the EMAIL field is removed from the certificate&#39; subject and set only in the, eventually present, extensions. The <b>email_in_dn</b> keyword can be used in the configuration file to enable this behaviour.</p>

<p>&#x4E00;&#x4E2A;&#x8BC1;&#x4E66;&#x7684;&#x4E3B;&#x4F53;&#x540D;&#x79F0;&#x53EF;&#x4EE5;&#x5305;&#x542B;E-mail&#x9879;&#x76EE;&#xFF0C;&#x4F46;&#x662F;&#x5C06;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x653E;&#x5728;&#x4E3B;&#x4F53;&#x522B;&#x540D;&#x4E2D;&#x4F1A;&#x66F4;&#x597D;&#x4E00;&#x70B9;&#x3002; &#x5F53;&#x4F60;&#x542F;&#x7528;&#x8FD9;&#x4E2A;&#x9009;&#x9879;&#x540E;e-mail&#x4F1A;&#x4ECE;&#x8BC1;&#x4E66;&#x4E3B;&#x4F53;&#x540D;&#x79F0;&#x79FB;&#x9664;&#x5E76;&#x6700;&#x7EC8;&#x8BBE;&#x5728;&#x4E3B;&#x4F53;&#x522B;&#x540D;&#x4E2D;&#x3002; &#x53EF;&#x4EE5;&#x5728;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x4F7F;&#x7528;email_in_dn&#x6765;&#x542F;&#x7528;&#x8FD9;&#x4E2A;&#x884C;&#x4E3A;&#x3002;</p>

</dd>
<dt id="batch"><b>-batch</b></dt>
<dd>

<p>this sets the batch mode. In this mode no questions will be asked and all certificates will be certified automatically.</p>

<p>&#x8BE5;&#x9009;&#x9879;&#x8BBE;&#x5B9A;batch&#x6A21;&#x5F0F;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x6A21;&#x5F0F;&#x4E2D;ca&#x6307;&#x4EE4;&#x4E0D;&#x63D0;&#x793A;&#x7528;&#x6237;&#x8F93;&#x5165;&#x4EFB;&#x4F55;&#x4FE1;&#x606F;&#x800C;&#x76F4;&#x63A5;&#x7B7E;&#x53D1;&#x6240;&#x6709;&#x8F93;&#x5165;&#x7684;&#x8BC1;&#x4E66;&#x8BF7;&#x6C42;&#x3002;</p>

</dd>
<dt id="extensions-section"><b>-extensions section</b></dt>
<dd>

<p>the section of the configuration file containing certificate extensions to be added when a certificate is issued (defaults to <b>x509_extensions</b> unless the <b>-extfile</b> option is used). If no extension section is present then, a V1 certificate is created. If the extension section is present (even if it is empty), then a V3 certificate is created. See the:w <a href="../man5/x509v3_config.html">x509v3_config(5)</a> manual page for details of the extension section format.</p>

<p>&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x90E8;&#x5206;&#x5305;&#x542B;&#x4E86;&#x9881;&#x53D1;&#x8BC1;&#x4E66;&#x65F6;&#x8981;&#x6DFB;&#x52A0;&#x7684;&#x8BC1;&#x4E66;&#x6269;&#x5C55;&#x540D;&#xFF08;&#x9ED8;&#x8BA4;&#x4E3A;x509_extensions,&#x9664;&#x975E;&#x4F7F;&#x7528;-extfile&#x9009;&#x9879;&#xFF09;&#x3002; &#x5982;&#x679C;&#x6CA1;&#x6709;&#x6269;&#x5C55;&#x90E8;&#x5206;&#xFF0C;&#x5219;&#x521B;&#x5EFA;V1&#x8BC1;&#x4E66;&#x3002;&#x5982;&#x679C;&#x5B58;&#x5728;&#x6269;&#x5C55;&#x90E8;&#x5206;&#xFF08;&#x5373;&#x4F7F;&#x8BE5;&#x90E8;&#x5206;&#x4E3A;&#x7A7A;&#xFF09;&#xFF0C;&#x5219;&#x521B;&#x5EFA;V3&#x8BC1;&#x4E66;&#x3002; &#x6709;&#x5173;&#x6269;&#x5C55;&#x90E8;&#x5206;&#x683C;&#x5F0F;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;x509v3_config&#xFF08;5&#xFF09;&#x624B;&#x518C;&#x9875;&#x3002;</p>

</dd>
<dt id="extfile-file"><b>-extfile file</b></dt>
<dd>

<p>an additional configuration file to read certificate extensions from (using the default section unless the <b>-extensions</b> option is also used).</p>

<p>&#x4E00;&#x4E2A;&#x4E13;&#x95E8;&#x7528;&#x6765;&#x4FDD;&#x5B58;X.509 v3&#x6269;&#x5C55;&#x9879;&#x4FE1;&#x606F;&#x7684;&#x6587;&#x4EF6;&#x3002;</p>

</dd>
<dt id="engine-id"><b>-engine id</b></dt>
<dd>

<p>specifying an engine (by its unique <b>id</b> string) will cause <b>ca</b> to attempt to obtain a functional reference to the specified engine, thus initialising it if needed. The engine will then be set as the default for all available algorithms.</p>

<p>&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x5F15;&#x64CE;&#xFF08;&#x901A;&#x8FC7;&#x5176;&#x552F;&#x4E00;&#x7684;id&#x5B57;&#x7B26;&#x4E32;&#xFF09;&#x4F1A;&#x5BFC;&#x81F4;ca&#x5C1D;&#x8BD5;&#x83B7;&#x53D6;&#x5BF9;&#x6307;&#x5B9A;engine&#x8BBE;&#x5907;&#x7684;&#x529F;&#x80FD;&#x5F15;&#x7528; &#x5E76;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#x5982;&#x679C;&#x9700;&#x8981;&#x3002;&#x8FD9;&#x4E2A;engine&#x5C06;&#x88AB;&#x8BBE;&#x7F6E;&#x4E3A;&#x6240;&#x6709;&#x53EF;&#x7528;&#x7B97;&#x6CD5;&#x7684;&#x9ED8;&#x8BA4;&#x3002;</p>

</dd>
<dt id="subj-arg"><b>-subj arg</b></dt>
<dd>

<p>supersedes subject name given in the request. The arg must be formatted as <i>/type0=value0/type1=value1/type2=...</i>, characters may be escaped by \ (backslash), no spaces are skipped.</p>

<p>&#x91CD;&#x65B0;&#x586B;&#x5199;&#x7528;&#x6237;&#x7684;&#x8BC1;&#x4E66;&#x4E3B;&#x4F53;&#x540D;&#x79F0;&#x3002;subj&#x9009;&#x9879;&#x7684;&#x53C2;&#x6570;&#x683C;&#x5F0F;&#x4E3A;/type0=value0/type1=value1/type2...&#xFF0C;&#x5B57;&#x7B26;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;\&#x8F6C;&#x4E49;&#xFF0C;&#x7A7A;&#x683C;&#x4E0D;&#x88AB;&#x8DF3;&#x8FC7;&#x3002;</p>

</dd>
<dt id="utf8"><b>-utf8</b></dt>
<dd>

<p>this option causes field values to be interpreted as UTF8 strings, by default they are interpreted as ASCII. This means that the field values, whether prompted from a terminal or obtained from a configuration file, must be valid UTF8 strings.</p>

<p>&#x8FD9;&#x4E00;&#x9009;&#x9879;&#x5B57;&#x6BB5;&#x503C;&#x8F6C;&#x4E3A;UTF8&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x4E3A;ASCII&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B57;&#x6BB5;&#x503C;&#xFF08;&#x65E0;&#x8BBA;&#x4ECE;&#x7EC8;&#x7AEF;&#x63D0;&#x793A;&#x8FD8;&#x662F;&#x4ECE;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x83B7;&#x53D6;&#xFF09;&#x90FD;&#x5FC5;&#x987B;&#x662F;&#x6709;&#x6548;&#x7684;UTF8&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>

</dd>
<dt id="create_serial"><b>-create_serial</b></dt>
<dd>

<p>if reading serial from the text file as specified in the configuration fails, specifying this option creates a new random serial to be used as next serial number.</p>

<p>&#x5982;&#x679C;&#x4ECE;&#x914D;&#x7F6E;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x8BFB;&#x53D6;&#x5E8F;&#x5217;&#x5931;&#x8D25;&#xFF0C;&#x8BE5;&#x9009;&#x9879;&#x53EF;&#x4EE5;&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x968F;&#x673A;&#x5E8F;&#x5217;&#x4F5C;&#x4E3A;&#x4E0B;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#x53F7;&#x3002;</p>

</dd>
<dt id="multivalue-rdn"><b>-multivalue-rdn</b></dt>
<dd>

<p>This option causes the -subj argument to be interpreted with full support for multivalued RDNs. Example:</p>

<p>&#x8BE5;&#x9009;&#x9879;&#x53EF;&#x4EE5;&#x89E3;&#x91CA;-subj&#x53C2;&#x6570;&#xFF0C;&#x5E76;&#x5B8C;&#x5168;&#x652F;&#x6301;&#x591A;RND&#x3002;</p>

<p><i>/DC=org/DC=GmSSL/DC=users/UID=123456+CN=John Doe</i></p>

<p>If -multi-rdn is not used then the UID value is <i>123456+CN=John Doe</i>.</p>

</dd>
</dl>

<h1 id="CRL-OPTIONS">CRL OPTIONS</h1>

<dl>

<dt id="gencrl"><b>-gencrl</b></dt>
<dd>

<p>this option generates a CRL based on information in the index file.</p>

<p>&#x8BE5;&#x9009;&#x9879;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x7D22;&#x5F15;&#x6587;&#x4EF6;&#x4FE1;&#x606F;&#x7684;CFL&#xFF0C;</p>

</dd>
<dt id="crldays-num"><b>-crldays num</b></dt>
<dd>

<p>the number of days before the next CRL is due. That is the days from now to place in the CRL nextUpdate field.</p>

<p>&#x4EE5;&ldquo;&#x5929;&rdquo;&#x4E3A;&#x5355;&#x4F4D;&#x8BBE;&#x7F6E;CRL&#x7684;&#x6709;&#x6548;&#x671F;&#x3002;</p>

</dd>
<dt id="crlhours-num"><b>-crlhours num</b></dt>
<dd>

<p>the number of hours before the next CRL is due.</p>

<p>&#x4EE5;&#x5C0F;&#x65F6;&#x4E3A;&#x5355;&#x4F4D;&#x8BBE;&#x7F6E;CRL&#x6709;&#x6548;&#x671F;&#x3002;</p>

</dd>
<dt id="revoke-filename"><b>-revoke filename</b></dt>
<dd>

<p>a filename containing a certificate to revoke.</p>

<p>&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x8981;&#x64A4;&#x9500;&#x7684;&#x8BC1;&#x4E66;&#x7684;&#x6587;&#x4EF6;&#x540D;</p>

</dd>
<dt id="valid-filename"><b>-valid filename</b></dt>
<dd>

<p>a filename containing a certificate to add a Valid certificate entry.</p>

<p>&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x6DFB;&#x52A0;&#x6709;&#x6548;&#x8BC1;&#x4E66;&#x6761;&#x76EE;&#x7684;&#x8BC1;&#x4E66;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x3002;</p>

</dd>
<dt id="status-serial"><b>-status serial</b></dt>
<dd>

<p>displays the revocation status of the certificate with the specified serial number and exits.</p>

<p>&#x663E;&#x793A;&#x5177;&#x6709;&#x6307;&#x5B9A;&#x5E8F;&#x5217;&#x53F7;&#x7684;&#x8BC1;&#x4E66;&#x7684;&#x64A4;&#x9500;&#x72B6;&#x6001;&#x5E76;&#x9000;&#x51FA;&#x3002;</p>

</dd>
<dt id="updatedb"><b>-updatedb</b></dt>
<dd>

<p>Updates the database index to purge expired certificates.</p>

<p>&#x66F4;&#x65B0;&#x6570;&#x636E;&#x5E93;&#x7D22;&#x5F15;&#x6E05;&#x9664;&#x4EE5;&#x8FC7;&#x671F;&#x7684;&#x8BC1;&#x4E66;&#x3002;</p>

</dd>
<dt id="crl_reason-reason"><b>-crl_reason reason</b></dt>
<dd>

<p>revocation reason, where <b>reason</b> is one of: <b>unspecified</b>, <b>keyCompromise</b>, <b>CACompromise</b>, <b>affiliationChanged</b>, <b>superseded</b>, <b>cessationOfOperation</b>, <b>certificateHold</b> or <b>removeFromCRL</b>. The matching of <b>reason</b> is case insensitive. Setting any revocation reason will make the CRL v2.</p>

<p>In practice <b>removeFromCRL</b> is not particularly useful because it is only used in delta CRLs which are not currently implemented.</p>

<p>&#x64A4;&#x9500;&#x539F;&#x56E0;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x539F;&#x56E0;&#x6709;&#xFF1A;&#x672A;&#x6307;&#x5B9A;&#xFF0C;key&#x59A5;&#x534F;&#xFF0C;CA&#x59A5;&#x534F;&#xFF0C;&#x8054;&#x7CFB;&#x6539;&#x53D8;&#xFF0C;superseded&#xFF0C;cessationofoperation&#xFF0C;insensitive&#x3002;&#x8BBE;&#x7F6E;&#x4EFB;&#x4F55;&#x64A4;&#x9500;&#x539F;&#x56E0;&#x5C06;&#x4F7F;CRL&#x53D8;&#x6210;v2.</p>

<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;removeFromCRL&#x4E0D;&#x662F;&#x7279;&#x522B;&#x6709;&#x7528;&#x56E0;&#x4E3A;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EC5;&#x7528;&#x4E8E;&#x5F53;&#x524D;&#x672A;&#x5B9E;&#x73B0;&#x7684;deltaCRL&#x3002;</p>

</dd>
<dt id="crl_hold-instruction"><b>-crl_hold instruction</b></dt>
<dd>

<p>This sets the CRL revocation reason code to <b>certificateHold</b> and the hold instruction to <b>instruction</b> which must be an OID. Although any OID can be used only <b>holdInstructionNone</b> (the use of which is discouraged by RFC2459) <b>holdInstructionCallIssuer</b> or <b>holdInstructionReject</b> will normally be used.</p>

<p>&#x8FD9;&#x4F1A;&#x5C06;CRL&#x64A4;&#x9500;&#x539F;&#x56E0;&#x4EE3;&#x7801;&#x8BBE;&#x7F6E;&#x4E3A;certificatehold&#xFF0C;&#x5E76;&#x5C06;&#x6307;&#x4EE4;&#x7684;&#x4FDD;&#x6301;&#x6307;&#x4EE4;&#x8BBE;&#x7F6E;&#x4E3A;&#x5FC5;&#x987B;&#x662F;OID&#x7684;&#x6307;&#x4EE4;&#x3002; &#x867D;&#x7136;&#x4EFB;&#x4F55;OID&#x53EA;&#x80FD;&#x4F7F;&#x7528;holdInstructionNone*RFC2459&#x4E0D;&#x9F13;&#x52B1;&#x4F7F;&#x7528;&#x5B83;&#xFF09;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x4F1A;&#x4F7F;&#x7528;holdInstructionCallIssuer&#x6216;holdInstruvtionReject&#x3002;</p>

</dd>
<dt id="crl_compromise-time"><b>-crl_compromise time</b></dt>
<dd>

<p>This sets the revocation reason to <b>keyCompromise</b> and the compromise time to <b>time</b>. <b>time</b> should be in GeneralizedTime format that is <b>YYYYMMDDHHMMSSZ</b>.</p>

<p>&#x5C06;&#x64A4;&#x9500;&#x539F;&#x56E0;&#x8BBE;&#x7F6E;&#x4E3A;keyCompromise&#x5E76;&#x5C06;&#x59A5;&#x534F;&#x65F6;&#x95F4;&#x8BBE;&#x4E3A;time&#x3002;time&#x5E94;&#x4E3A;&#x5E7F;&#x4E49;&#x65F6;&#x95F4;&#x683C;&#x5F0F;&#xFF1A;YYYYMMDDHHMMSSZ&#x3002;</p>

</dd>
<dt id="crl_CA_compromise-time"><b>-crl_CA_compromise time</b></dt>
<dd>

<p>This is the same as <b>crl_compromise</b> except the revocation reason is set to <b>CACompromise</b>.</p>

<p>&#x8BE5;&#x9009;&#x9879;&#x4E0E;crl_compromise&#x4E00;&#x6837;&#xFF0C;&#x9664;&#x4E86;&#x64A4;&#x9500;&#x539F;&#x56E0;&#x662F;CACompromise&#x3002;</p>

</dd>
<dt id="crlexts-section"><b>-crlexts section</b></dt>
<dd>

<p>the section of the configuration file containing CRL extensions to include. If no CRL extension section is present then a V1 CRL is created, if the CRL extension section is present (even if it is empty) then a V2 CRL is created. The CRL extensions specified are CRL extensions and <b>not</b> CRL entry extensions. It should be noted that some software (for example Netscape) can&#39;t handle V2 CRLs. See <a href="../man5/x509v3_config.html">x509v3_config(5)</a> manual page for details of the extension section format.</p>

<p>&#x8FD9;&#x90E8;&#x5206;&#x5305;&#x542B;CRL&#x6269;&#x5C55;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002; &#x5982;&#x679C;&#x4E0D;&#x5B58;&#x5728;CRL&#x6269;&#x5C55;&#x90E8;&#x5206;&#xFF0C;&#x5219;&#x521B;&#x5EFA;V1 CRL&#xFF0C;&#x5982;&#x679C;&#x5B58;&#x5728;CRL&#x6269;&#x5C55;&#x90E8;&#x5206;&#xFF08;&#x5373;&#x4F7F;&#x4E3A;&#x7A7A;&#xFF09;&#xFF0C;&#x5219;&#x521B;&#x5EFA;V2 CRL&#x3002; &#x6307;&#x5B9A;&#x7684;CRL&#x6269;&#x5C55;&#x662F;CRL&#x6269;&#x5C55;&#xFF0C;&#x800C;&#x4E0D;&#x662F;CRL&#x6761;&#x76EE;&#x6269;&#x5C55;&#x3002; &#x5E94;&#x8BE5;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x67D0;&#x4E9B;&#x8F6F;&#x4EF6;&#xFF08;&#x4F8B;&#x5982;Netscape&#xFF09;&#x65E0;&#x6CD5;&#x5904;&#x7406;V2 CRL&#x3002; &#x6709;&#x5173;&#x6269;&#x5C55;&#x90E8;&#x5206;&#x683C;&#x5F0F;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;x509v3_config&#xFF08;5&#xFF09;&#x624B;&#x518C;&#x9875;&#x3002;</p>

</dd>
</dl>

<h1 id="CONFIGURATION-FILE-OPTIONS">CONFIGURATION FILE OPTIONS</h1>

<p>The section of the configuration file containing options for <b>ca</b> is found as follows: If the <b>-name</b> command line option is used, then it names the section to be used. Otherwise the section to be used must be named in the <b>default_ca</b> option of the <b>ca</b> section of the configuration file (or in the default section of the configuration file). Besides <b>default_ca</b>, the following options are read directly from the <b>ca</b> section: RANDFILE preserve msie_hack With the exception of <b>RANDFILE</b>, this is probably a bug and may change in future releases.</p>

<p>Many of the configuration file options are identical to command line options. Where the option is present in the configuration file and the command line the command line value is used. Where an option is described as mandatory then it must be present in the configuration file or the command line equivalent (if any) used.</p>

<p>&#x5305;&#x542B;ca&#x9009;&#x9879;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x90E8;&#x5206;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;&#x5982;&#x679C;&#x4F7F;&#x7528;-name&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#xFF0C;&#x5219;&#x547D;&#x540D;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x90E8;&#x5206;&#x3002; &#x5426;&#x5219;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x90E8;&#x5206;&#x5FC5;&#x987B;&#x5728;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF08;&#x6216;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#x9ED8;&#x8BA4;&#x90E8;&#x5206;&#xFF09;&#x7684;ca&#x90E8;&#x5206;&#x7684;default_ca&#x9009;&#x9879;&#x4E2D;&#x547D;&#x540D;&#x3002; &#x9664;&#x4E86;default_ca&#xFF0C;&#x4EE5;&#x4E0B;&#x9009;&#x9879;&#x76F4;&#x63A5;&#x4ECE;ca&#x90E8;&#x5206;&#x8BFB;&#x53D6;&#xFF1A;RANDFILE preserve msie_hack&#x9664;&#x4E86;RANDFILE&#x4E4B;&#x5916;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x5C06;&#x6765;&#x7684;&#x7248;&#x672C;&#x4E2D;&#x66F4;&#x6539;&#x3002;</p>

<p>&#x8BB8;&#x591A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x9009;&#x9879;&#x4E0E;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x76F8;&#x540C;&#x3002; &#x5728;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x548C;&#x547D;&#x4EE4;&#x884C;&#x4E2D;&#x5B58;&#x5728;&#x9009;&#x9879;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4F7F;&#x7528;&#x547D;&#x4EE4;&#x884C;&#x503C;&#x3002; &#x5728;&#x67D0;&#x4E2A;&#x9009;&#x9879;&#x88AB;&#x63CF;&#x8FF0;&#x4E3A;&#x5F3A;&#x5236;&#x6027;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x5B58;&#x5728;&#x4E8E;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x6216;&#x547D;&#x4EE4;&#x884C;&#x7B49;&#x6548;&#xFF08;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;&#xFF09;&#x4E2D;&#x3002;</p>

<dl>

<dt id="oid_file"><b>oid_file</b></dt>
<dd>

<p>This specifies a file containing additional <b>OBJECT IDENTIFIERS</b>. Each line of the file should consist of the numerical form of the object identifier followed by white space then the short name followed by white space and finally the long name.</p>

<p>&#x8FD9;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x6587;&#x4EF6;&#x3002; &#x6587;&#x4EF6;&#x7684;&#x6BCF;&#x4E00;&#x884C;&#x5E94;&#x7531;&#x5BF9;&#x8C61;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x6570;&#x5B57;&#x5F62;&#x5F0F;&#x7EC4;&#x6210; &#xFF0C;&#x540E;&#x8DDF;&#x7A7A;&#x683C;&#xFF0C;&#x77ED;&#x540D;&#x79F0;&#x540E;&#x8DDF;&#x7A7A;&#x683C;&#xFF0C;&#x6700;&#x540E;&#x662F;&#x957F;&#x540D;&#x79F0;&#x3002;</p>

</dd>
<dt id="oid_section"><b>oid_section</b></dt>
<dd>

<p>This specifies a section in the configuration file containing extra object identifiers. Each line should consist of the short name of the object identifier followed by <b>=</b> and the numerical form. The short and long names are the same when this option is used.</p>

<p>&#x8FD9;&#x6307;&#x5B9A;&#x4E86;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x5305;&#x542B;&#x989D;&#x5916;&#x5BF9;&#x8C61;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x90E8;&#x5206;&#x3002; &#x6BCF;&#x4E00;&#x884C;&#x90FD;&#x5E94;&#x8BE5;&#x5305;&#x542B;&#x5BF9;&#x8C61;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x77ED;&#x540D;&#x79F0;&#xFF0C; &#x540E;&#x9762;&#x662F;=&#x548C;&#x6570;&#x5B57;&#x5F62;&#x5F0F;&#x3002; &#x5F53;&#x4F7F;&#x7528;&#x6B64;&#x9009;&#x9879;&#x65F6;&#xFF0C;&#x77ED;&#x540D;&#x79F0;&#x548C;&#x957F;&#x540D;&#x79F0;&#x76F8;&#x540C;&#x3002;</p>

</dd>
<dt id="new_certs_dir"><b>new_certs_dir</b></dt>
<dd>

<p>the same as the <b>-outdir</b> command line option. It specifies the directory where new certificates will be placed. Mandatory.</p>

<p>&#x4E0E;-outdir&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x76F8;&#x540C;&#x3002; &#x5B83;&#x6307;&#x5B9A;&#x5C06;&#x653E;&#x7F6E;&#x65B0;&#x8BC1;&#x4E66;&#x7684;&#x76EE;&#x5F55;&#x3002;&#x5F3A;&#x5236;&#x6027;&#x3002;</p>

</dd>
<dt id="certificate"><b>certificate</b></dt>
<dd>

<p>the same as <b>-cert</b>. It gives the file containing the CA certificate. Mandatory.</p>

<p>&#x4E0E;-cert&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x76F8;&#x540C;&#x3002;&#x5B83;&#x7ED9;&#x51FA;&#x5305;&#x542B;CA&#x8BC1;&#x4E66;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x5F3A;&#x5236;&#x6027;&#x3002;</p>

</dd>
<dt id="private_key"><b>private_key</b></dt>
<dd>

<p>same as the <b>-keyfile</b> option. The file containing the CA private key. Mandatory.</p>

<p>&#x4E0E;-keyfile&#x9009;&#x9879;&#x76F8;&#x540C;&#x3002;&#x6587;&#x4EF6;&#x5305;&#x542B;CA&#x79C1;&#x94A5;&#x3002;&#x5F3A;&#x5236;&#x6027;&#x3002;</p>

</dd>
<dt id="RANDFILE"><b>RANDFILE</b></dt>
<dd>

<p>a file used to read and write random number seed information, or an EGD socket (see <a href="../man3/RAND_egd.html">RAND_egd(3)</a>).</p>

<p>&#x7528;&#x4E8E;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x968F;&#x673A;&#x6570;&#x79CD;&#x5B50;&#x4FE1;&#x606F;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x6216;EGD&#x5957;&#x63A5;&#x5B57;&#xFF08;&#x8BF7;&#x53C2;&#x9605;RAND_egd&#xFF08;3&#xFF09;&#xFF09;&#x3002;</p>

</dd>
<dt id="default_days"><b>default_days</b></dt>
<dd>

<p>the same as the <b>-days</b> option. The number of days to certify a certificate for.</p>

<p>&#x548C;-days&#x76F8;&#x540C;&#x3002;&#x8BA4;&#x8BC1;&#x8BC1;&#x4E66;&#x7684;&#x5929;&#x6570;&#x3002;</p>

</dd>
<dt id="default_startdate"><b>default_startdate</b></dt>
<dd>

<p>the same as the <b>-startdate</b> option. The start date to certify a certificate for. If not set the current time is used.</p>

<p>&#x548C;-startdate&#x76F8;&#x540C;&#x3002;&#x8BA4;&#x8BC1;&#x8BC1;&#x4E66;&#x7684;&#x5F00;&#x59CB;&#x65E5;&#x671F;&#x3002; &#x5982;&#x679C;&#x672A;&#x8BBE;&#x7F6E;&#xFF0C;&#x5219;&#x4F7F;&#x7528;&#x5F53;&#x524D;&#x65F6;&#x95F4;&#x3002;</p>

</dd>
<dt id="default_enddate"><b>default_enddate</b></dt>
<dd>

<p>the same as the <b>-enddate</b> option. Either this option or <b>default_days</b> (or the command line equivalents) must be present.</p>

<p>&#x548C;-enddate&#x76F8;&#x540C;&#x3002;&#x8BE5;&#x9009;&#x9879;&#x6216;default_days&#xFF08;&#x6216;&#x547D;&#x4EE4;&#x884C;&#x7B49;&#x6548;&#x9879;&#xFF09;&#x5FC5;&#x987B;&#x5B58;&#x5728;&#x3002;</p>

</dd>
<dt id="default_crl_hours-default_crl_days"><b>default_crl_hours default_crl_days</b></dt>
<dd>

<p>the same as the <b>-crlhours</b> and the <b>-crldays</b> options. These will only be used if neither command line option is present. At least one of these must be present to generate a CRL.</p>

<p>&#x4E0E;-crlhours&#x548C;-crldays&#x9009;&#x9879;&#x4E00;&#x6837;&#x3002; &#x53EA;&#x6709;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x624D;&#x4F1A;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x3002; &#x5FC5;&#x987B;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x5FC5;&#x987B;&#x5B58;&#x5728;&#x624D;&#x80FD;&#x751F;&#x6210;CRL&#x3002;</p>

</dd>
<dt id="default_md"><b>default_md</b></dt>
<dd>

<p>the same as the <b>-md</b> option. Mandatory.</p>

<p>&#x548C;-md&#x4E00;&#x6837;&#x3002;&#x5F3A;&#x5236;&#x6027;&#x3002;</p>

</dd>
<dt id="database"><b>database</b></dt>
<dd>

<p>the text database file to use. Mandatory. This file must be present though initially it will be empty.</p>

<p>&#x8981;&#x4F7F;&#x7528;&#x7684;&#x6587;&#x672C;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#x3002;&#x5F3A;&#x5236;&#x6027;&#x3002;&#x8BE5;&#x6587;&#x4EF6;&#x5FC5;&#x987B;&#x5B58;&#x5728;&#x4F46;&#x4E00;&#x5F00;&#x59CB;&#x5B83;&#x662F;&#x7A7A;&#x7684;&#x3002;</p>

</dd>
<dt id="unique_subject"><b>unique_subject</b></dt>
<dd>

<p>if the value <b>yes</b> is given, the valid certificate entries in the database must have unique subjects. if the value <b>no</b> is given, several valid certificate entries may have the exact same subject. The default value is <b>yes</b>, to be compatible with older (pre 0.9.8) versions of GmSSL. However, to make CA certificate roll-over easier, it&#39;s recommended to use the value <b>no</b>, especially if combined with the <b>-selfsign</b> command line option.</p>

<p>&#x5982;&#x679C;&#x7ED9;&#x51FA;&#x503C;yes&#xFF0C;&#x5219;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6709;&#x6548;&#x8BC1;&#x4E66;&#x6761;&#x76EE;&#x5FC5;&#x987B;&#x5177;&#x6709;&#x552F;&#x4E00;&#x4E3B;&#x9898;&#x3002; &#x5982;&#x679C;&#x7ED9;&#x51FA;&#x503C;no&#xFF0C;&#x51E0;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x8BC1;&#x4E66;&#x6761;&#x76EE;&#x53EF;&#x80FD;&#x5177;&#x6709;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x4E3B;&#x9898;&#x3002; &#x9ED8;&#x8BA4;&#x503C;&#x4E3A;yes&#xFF0C;&#x4E0E;GmSSL&#x7684;&#x65E7;&#x7248;&#xFF08;0.9.8&#xFF09;&#x7248;&#x672C;&#x517C;&#x5BB9;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x4E3A;&#x4E86;&#x4F7F;CA&#x8BC1;&#x4E66;&#x8F6C;&#x6362;&#x66F4;&#x5BB9;&#x6613;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#x503C;no&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5982;&#x679C;&#x4E0E;-selfsign&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x76F8;&#x7ED3;&#x5408;&#x3002;</p>

</dd>
<dt id="serial"><b>serial</b></dt>
<dd>

<p>a text file containing the next serial number to use in hex. Mandatory. This file must be present and contain a valid serial number.</p>

<p>&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4E86;&#x4E0B;&#x4E00;&#x4E2A;&#x8981;&#x4F7F;&#x7528;&#x5E8F;&#x5217;&#x53F7;&#x7684;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x3002;&#x5F3A;&#x5236;&#x6027;&#x3002; &#x8BE5;&#x6587;&#x4EF6;&#x5FC5;&#x987B;&#x5B58;&#x5728;&#x5E76;&#x5305;&#x542B;&#x6709;&#x6548;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#x3002;</p>

</dd>
<dt id="crlnumber"><b>crlnumber</b></dt>
<dd>

<p>a text file containing the next CRL number to use in hex. The crl number will be inserted in the CRLs only if this file exists. If this file is present, it must contain a valid CRL number.</p>

<p>&#x5305;&#x542B;&#x7528;&#x4E8E;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;CRL&#x7F16;&#x53F7;&#x7684;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x3002; &#x53EA;&#x6709;&#x5F53;&#x6B64;&#x6587;&#x4EF6;&#x5B58;&#x5728;&#x65F6;&#xFF0C;crl&#x53F7;&#x624D;&#x4F1A;&#x63D2;&#x5165;&#x5230;CRL&#x4E2D;&#x3002; &#x5982;&#x679C;&#x6B64;&#x6587;&#x4EF6;&#x5B58;&#x5728;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x5305;&#x542B;&#x6709;&#x6548;&#x7684;CRL&#x53F7;&#x7801;&#x3002;</p>

</dd>
<dt id="x509_extensions"><b>x509_extensions</b></dt>
<dd>

<p>the same as <b>-extensions</b>.</p>

<p>&#x548C;-extensions&#x4E00;&#x6837;</p>

</dd>
<dt id="crl_extensions"><b>crl_extensions</b></dt>
<dd>

<p>the same as <b>-crlexts</b>.</p>

<p>&#x548C;-crlexts&#x4E00;&#x6837;</p>

</dd>
<dt id="preserve"><b>preserve</b></dt>
<dd>

<p>the same as <b>-preserveDN</b></p>

<p>&#x548C;-peserveDN&#x4E00;&#x6837;</p>

</dd>
<dt id="email_in_dn"><b>email_in_dn</b></dt>
<dd>

<p>the same as <b>-noemailDN</b>. If you want the EMAIL field to be removed from the DN of the certificate simply set this to &#39;no&#39;. If not present the default is to allow for the EMAIL field in the certificate&#39;s DN.</p>

<p>&#x548C;-noemailDN&#x4E00;&#x6837;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5E0C;&#x671B;&#x5C06;EMAIL&#x5B57;&#x6BB5;&#x4ECE;&#x8BC1;&#x4E66;&#x7684;DN&#x4E2D;&#x5220;&#x9664;&#xFF0C;&#x8BF7;&#x5C06;&#x5176;&#x8BBE;&#x7F6E;&#x4E3A;&ldquo;&#x5426;&rdquo;&#x3002; &#x5982;&#x679C;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x9ED8;&#x8BA4;&#x503C;&#x662F;&#x5141;&#x8BB8;&#x8BC1;&#x4E66;&#x7684;DN&#x4E2D;&#x7684;EMAIL&#x5B57;&#x6BB5;&#x3002;</p>

</dd>
<dt id="msie_hack1"><b>msie_hack</b></dt>
<dd>

<p>the same as <b>-msie_hack</b></p>

<p>&#x548C;-msie_hack&#x4E00;&#x6837;</p>

</dd>
<dt id="policy"><b>policy</b></dt>
<dd>

<p>the same as <b>-policy</b>. Mandatory. See the <b>POLICY FORMAT</b> section for more information.</p>

<p>&#x548C;-policy&#x4E00;&#x6837;&#x3002;&#x5F3A;&#x5236;&#x6027;&#x3002;&#x66F4;&#x591A;&#x8BE6;&#x60C5;&#x8BF7;&#x53C2;&#x8003;POLICY FORMAT&#x90E8;&#x5206;&#x3002;</p>

</dd>
<dt id="name_opt-cert_opt"><b>name_opt</b>, <b>cert_opt</b></dt>
<dd>

<p>these options allow the format used to display the certificate details when asking the user to confirm signing. All the options supported by the <b>x509</b> utilities <b>-nameopt</b> and <b>-certopt</b> switches can be used here, except the <b>no_signame</b> and <b>no_sigdump</b> are permanently set and cannot be disabled (this is because the certificate signature cannot be displayed because the certificate has not been signed at this point).</p>

<p>For convenience the values <b>ca_default</b> are accepted by both to produce a reasonable output.</p>

<p>If neither option is present the format used in earlier versions of GmSSL is used. Use of the old format is <b>strongly</b> discouraged because it only displays fields mentioned in the <b>policy</b> section, mishandles multicharacter string types and does not display extensions.</p>

<p>&#x8FD9;&#x4E9B;&#x9009;&#x9879;&#x5141;&#x8BB8;&#x5728;&#x8BE2;&#x95EE;&#x7528;&#x6237;&#x786E;&#x8BA4;&#x7B7E;&#x540D;&#x65F6;&#x7528;&#x4E8E;&#x663E;&#x793A;&#x8BC1;&#x4E66;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x7684;&#x683C;&#x5F0F;&#x3002; x509 utilities -nameopt&#x548C;-certopt&#x5F00;&#x5173;&#x652F;&#x6301;&#x7684;&#x6240;&#x6709;&#x9009;&#x9879;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#xFF0C;&#x9664;&#x4E86;no_signame&#x548C;no_sigdump&#x88AB;&#x6C38;&#x4E45;&#x8BBE;&#x7F6E;&#x5E76;&#x4E14;&#x4E0D;&#x80FD;&#x7981;&#x7528;&#xFF08;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x8BC1;&#x4E66;&#x7B7E;&#x540D;&#x65E0;&#x6CD5;&#x663E;&#x793A;&#xFF0C;&#x56E0;&#x4E3A;&#x8BC1;&#x4E66;&#x5C1A;&#x672A;&#x5728;&#x6B64;&#x7B7E;&#x540D; &#x70B9;&#xFF09;&#x3002;</p>

<p>&#x4E3A;&#x65B9;&#x4FBF;&#x8D77;&#x89C1;&#xFF0C;ca_default&#x503C;&#x88AB;&#x4E24;&#x8005;&#x63A5;&#x53D7;&#x4EE5;&#x4EA7;&#x751F;&#x5408;&#x7406;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>

<p>&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x9009;&#x9879;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x5219;&#x4F7F;&#x7528;&#x65E9;&#x671F;&#x7248;&#x672C;&#x7684;GmSSL&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x683C;&#x5F0F;&#x3002; &#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x65E7;&#x683C;&#x5F0F;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EC5;&#x663E;&#x793A;&#x7B56;&#x7565;&#x90E8;&#x5206;&#x4E2D;&#x63D0;&#x53CA;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x5904;&#x7406;&#x591A;&#x5B57;&#x7B26;&#x4E32;&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x663E;&#x793A;&#x6269;&#x5C55;&#x540D;&#x3002;</p>

</dd>
<dt id="copy_extensions"><b>copy_extensions</b></dt>
<dd>

<p>determines how extensions in certificate requests should be handled. If set to <b>none</b> or this option is not present then extensions are ignored and not copied to the certificate. If set to <b>copy</b> then any extensions present in the request that are not already present are copied to the certificate. If set to <b>copyall</b> then all extensions in the request are copied to the certificate: if the extension is already present in the certificate it is deleted first. See the <b>WARNINGS</b> section before using this option.</p>

<p>The main use of this option is to allow a certificate request to supply values for certain extensions such as subjectAltName.</p>

<p>&#x786E;&#x5B9A;&#x5982;&#x4F55;&#x5904;&#x7406;&#x8BC1;&#x4E66;&#x8BF7;&#x6C42;&#x4E2D;&#x7684;&#x6269;&#x5C55;&#x3002; &#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x4E3A;none&#x6216;&#x6B64;&#x9009;&#x9879;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x5219;&#x6269;&#x5C55;&#x540D;&#x5C06;&#x88AB;&#x5FFD;&#x7565;&#xFF0C;&#x4E0D;&#x4F1A;&#x590D;&#x5236;&#x5230;&#x8BC1;&#x4E66;&#x3002; &#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x4E3A;&#x590D;&#x5236;&#xFF0C;&#x8BF7;&#x6C42;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x4EFB;&#x4F55;&#x5C1A;&#x672A;&#x5B58;&#x5728;&#x7684;&#x6269;&#x5C55;&#x540D;&#x5C06;&#x590D;&#x5236;&#x5230;&#x8BC1;&#x4E66;&#x3002; &#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x4E3A;copyall&#xFF0C;&#x5219;&#x8BF7;&#x6C42;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x6269;&#x5C55;&#x90FD;&#x5C06;&#x590D;&#x5236;&#x5230;&#x8BC1;&#x4E66;&#x4E2D;&#xFF1A;&#x5982;&#x679C;&#x6269;&#x5C55;&#x540D;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E8E;&#x8BC1;&#x4E66;&#x4E2D;&#xFF0C;&#x5219;&#x9996;&#x5148;&#x5C06;&#x5176;&#x5220;&#x9664;&#x3002; &#x4F7F;&#x7528;&#x6B64;&#x9009;&#x9879;&#x4E4B;&#x524D;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x8B66;&#x544A;&#x90E8;&#x5206;&#x3002;</p>

<p>&#x6B64;&#x9009;&#x9879;&#x7684;&#x4E3B;&#x8981;&#x7528;&#x9014;&#x662F;&#x5141;&#x8BB8;&#x8BC1;&#x4E66;&#x8BF7;&#x6C42;&#x4E3A;&#x67D0;&#x4E9B;&#x6269;&#x5C55;&#x540D;&#xFF08;&#x5982;subjectAltName&#xFF09;&#x63D0;&#x4F9B;&#x503C;&#x3002;</p>

</dd>
</dl>

<h1 id="POLICY-FORMAT">POLICY FORMAT</h1>

<p>The policy section consists of a set of variables corresponding to certificate DN fields. If the value is &quot;match&quot; then the field value must match the same field in the CA certificate. If the value is &quot;supplied&quot; then it must be present. If the value is &quot;optional&quot; then it may be present. Any fields not mentioned in the policy section are silently deleted, unless the <b>-preserveDN</b> option is set but this can be regarded more of a quirk than intended behaviour.</p>

<h1 id="SPKAC-FORMAT">SPKAC FORMAT</h1>

<p>The input to the <b>-spkac</b> command line option is a Netscape signed public key and challenge. This will usually come from the <b>KEYGEN</b> tag in an HTML form to create a new private key. It is however possible to create SPKACs using the <b>spkac</b> utility.</p>

<p>The file should contain the variable SPKAC set to the value of the SPKAC and also the required DN components as name value pairs. If you need to include the same component twice then it can be preceded by a number and a &#39;.&#39;.</p>

<p>When processing SPKAC format, the output is DER if the <b>-out</b> flag is used, but PEM format if sending to stdout or the <b>-outdir</b> flag is used.</p>

<h1 id="EXAMPLES">EXAMPLES</h1>

<p>Note: these examples assume that the <b>ca</b> directory structure is already set up and the relevant files already exist. This usually involves creating a CA certificate and private key with <b>req</b>, a serial number file and an empty index file and placing them in the relevant directories.</p>

<p>To use the sample configuration file below the directories demoCA, demoCA/private and demoCA/newcerts would be created. The CA certificate would be copied to demoCA/cacert.pem and its private key to demoCA/private/cakey.pem. A file demoCA/serial would be created containing for example &quot;01&quot; and the empty index file demoCA/index.txt.</p>

<p>Sign a certificate request:</p>

<pre><code> gmssl ca -in req.pem -out newcert.pem</code></pre>

<p>Sign a certificate request, using CA extensions:</p>

<pre><code> gmssl ca -in req.pem -extensions v3_ca -out newcert.pem</code></pre>

<p>Generate a CRL</p>

<pre><code> gmssl ca -gencrl -out crl.pem</code></pre>

<p>Sign several requests:</p>

<pre><code> gmssl ca -infiles req1.pem req2.pem req3.pem</code></pre>

<p>Certify a Netscape SPKAC:</p>

<pre><code> gmssl ca -spkac spkac.txt</code></pre>

<p>A sample SPKAC file (the SPKAC line has been truncated for clarity):</p>

<pre><code> SPKAC=MIG0MGAwXDANBgkqhkiG9w0BAQEFAANLADBIAkEAn7PDhCeV/xIxUg8V70YRxK2A5
 CN=Steve Test
 emailAddress=steve@gmssl.org
 0.OU=GmSSL Group
 1.OU=Another Group</code></pre>

<p>A sample configuration file with the relevant sections for <b>ca</b>:</p>

<pre><code> [ ca ]
 default_ca      = CA_default            # The default ca section

 [ CA_default ]

 dir            = ./demoCA              # top dir
 database       = $dir/index.txt        # index file.
 new_certs_dir  = $dir/newcerts         # new certs dir

 certificate    = $dir/cacert.pem       # The CA cert
 serial         = $dir/serial           # serial no file
 private_key    = $dir/private/cakey.pem# CA private key
 RANDFILE       = $dir/private/.rand    # random number file

 default_days   = 365                   # how long to certify for
 default_crl_days= 30                   # how long before next CRL
 default_md     = md5                   # md to use

 policy         = policy_any            # default policy
 email_in_dn    = no                    # Don&#39;t add the email into cert DN

 name_opt       = ca_default            # Subject name display option
 cert_opt       = ca_default            # Certificate display option
 copy_extensions = none                 # Don&#39;t copy extensions from request

 [ policy_any ]
 countryName            = supplied
 stateOrProvinceName    = optional
 organizationName       = optional
 organizationalUnitName = optional
 commonName             = supplied
 emailAddress           = optional</code></pre>

<h1 id="FILES">FILES</h1>

<p>Note: the location of all files can change either by compile time options, configuration file entries, environment variables or command line options. The values below reflect the default values.</p>

<pre><code> /usr/local/ssl/lib/openssl.cnf - master configuration file
 ./demoCA                       - main CA directory
 ./demoCA/cacert.pem            - CA certificate
 ./demoCA/private/cakey.pem     - CA private key
 ./demoCA/serial                - CA serial number file
 ./demoCA/serial.old            - CA serial number backup file
 ./demoCA/index.txt             - CA text database file
 ./demoCA/index.txt.old         - CA text database backup file
 ./demoCA/certs                 - certificate output file
 ./demoCA/.rnd                  - CA random seed information</code></pre>

<h1 id="ENVIRONMENT-VARIABLES">ENVIRONMENT VARIABLES</h1>

<p><b>OPENSSL_CONF</b> reflects the location of master configuration file it can be overridden by the <b>-config</b> command line option.</p>

<h1 id="RESTRICTIONS">RESTRICTIONS</h1>

<p>The text database index file is a critical part of the process and if corrupted it can be difficult to fix. It is theoretically possible to rebuild the index file from all the issued certificates and a current CRL: however there is no option to do this.</p>

<p>V2 CRL features like delta CRLs are not currently supported.</p>

<p>Although several requests can be input and handled at once it is only possible to include one SPKAC or self-signed certificate.</p>

<h1 id="BUGS">BUGS</h1>

<p>The use of an in-memory text database can cause problems when large numbers of certificates are present because, as the name implies the database has to be kept in memory.</p>

<p>The <b>ca</b> command really needs rewriting or the required functionality exposed at either a command or interface level so a more friendly utility (perl script or GUI) can handle things properly. The script <b>CA.pl</b> helps a little but not very much.</p>

<p>Any fields in a request that are not present in a policy are silently deleted. This does not happen if the <b>-preserveDN</b> option is used. To enforce the absence of the EMAIL field within the DN, as suggested by RFCs, regardless the contents of the request&#39; subject the <b>-noemailDN</b> option can be used. The behaviour should be more friendly and configurable.</p>

<p>Canceling some commands by refusing to certify a certificate can create an empty file.</p>

<h1 id="WARNINGS">WARNINGS</h1>

<p>The <b>ca</b> command is quirky and at times downright unfriendly.</p>

<p>The <b>ca</b> utility was originally meant as an example of how to do things in a CA. It was not supposed to be used as a full blown CA itself: nevertheless some people are using it for this purpose.</p>

<p>The <b>ca</b> command is effectively a single user command: no locking is done on the various files and attempts to run more than one <b>ca</b> command on the same database can have unpredictable results.</p>

<p>The <b>copy_extensions</b> option should be used with caution. If care is not taken then it can be a security risk. For example if a certificate request contains a basicConstraints extension with CA:TRUE and the <b>copy_extensions</b> value is set to <b>copyall</b> and the user does not spot this when the certificate is displayed then this will hand the requester a valid CA certificate.</p>

<p>This situation can be avoided by setting <b>copy_extensions</b> to <b>copy</b> and including basicConstraints with CA:FALSE in the configuration file. Then if the request contains a basicConstraints extension it will be ignored.</p>

<p>It is advisable to also include values for other extensions such as <b>keyUsage</b> to prevent a request supplying its own values.</p>

<p>Additional restrictions can be placed on the CA certificate itself. For example if the CA certificate has:</p>

<pre><code> basicConstraints = CA:TRUE, pathlen:0</code></pre>

<p>then even if a certificate is issued with CA:TRUE it will not be valid.</p>

<h1 id="SEE-ALSO">SEE ALSO</h1>

<p><a href="../man1/req">req(1)</a>, <a href="../man1/spkac">spkac(1)</a>, <a href="../man1/x509">x509(1)</a>, <a href="../man1/CA.pl">CA.pl(1)</a>, <a href="../man5/config">config(5)</a>, <a href="../man5/x509v3_config.html">x509v3_config(5)</a></p>

<h1 id="COPYRIGHT">COPYRIGHT</h1>

<p>Copyright 2000-2016 The OpenSSL Project Authors. All Rights Reserved.</p>

<p>Licensed under the GmSSL license (the &quot;License&quot;). You may not use this file except in compliance with the License. You can obtain a copy in the file LICENSE in the source distribution or at <a href="https://www.openssl.org/source/license.html">https://www.openssl.org/source/license.html</a>.</p>


</body>

</html>


