<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>x509</title>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rev="made" href="mailto:root@localhost" />
</head>

<body>



<ul id="index">
  <li><a href="#NAME">NAME</a></li>
  <li><a href="#SYNOPSIS">SYNOPSIS</a></li>
  <li><a href="#DESCRIPTION">DESCRIPTION</a></li>
  <li><a href="#OPTIONS">OPTIONS</a>
    <ul>
      <li><a href="#Input-Output-and-General-Purpose-Options">Input, Output, and General Purpose Options</a></li>
      <li><a href="#Display-Options">Display Options</a></li>
      <li><a href="#Trust-Settings">Trust Settings</a></li>
      <li><a href="#Signing-Options">Signing Options</a></li>
      <li><a href="#Name-Options">Name Options</a></li>
      <li><a href="#Text-Options">Text Options</a></li>
    </ul>
  </li>
  <li><a href="#EXAMPLES">EXAMPLES</a></li>
  <li><a href="#NOTES">NOTES</a></li>
  <li><a href="#CERTIFICATE-EXTENSIONS">CERTIFICATE EXTENSIONS</a></li>
  <li><a href="#BUGS">BUGS</a></li>
  <li><a href="#SEE-ALSO">SEE ALSO</a></li>
  <li><a href="#HISTORY">HISTORY</a></li>
  <li><a href="#COPYRIGHT">COPYRIGHT</a></li>
</ul>

<h1 id="NAME">NAME</h1>

<p>x509 - Certificate display and signing utility</p>

<h1 id="SYNOPSIS">SYNOPSIS</h1>

<p><b>gmssl</b> <b>x509</b> [<b>-help</b>] [<b>-inform DER|PEM|NET</b>] [<b>-outform DER|PEM|NET</b>] [<b>-keyform DER|PEM</b>] [<b>-CAform DER|PEM</b>] [<b>-CAkeyform DER|PEM</b>] [<b>-in filename</b>] [<b>-out filename</b>] [<b>-serial</b>] [<b>-hash</b>] [<b>-subject_hash</b>] [<b>-issuer_hash</b>] [<b>-ocspid</b>] [<b>-subject</b>] [<b>-issuer</b>] [<b>-nameopt option</b>] [<b>-email</b>] [<b>-ocsp_uri</b>] [<b>-startdate</b>] [<b>-enddate</b>] [<b>-purpose</b>] [<b>-dates</b>] [<b>-checkend num</b>] [<b>-modulus</b>] [<b>-pubkey</b>] [<b>-fingerprint</b>] [<b>-alias</b>] [<b>-noout</b>] [<b>-trustout</b>] [<b>-clrtrust</b>] [<b>-clrreject</b>] [<b>-addtrust arg</b>] [<b>-addreject arg</b>] [<b>-setalias arg</b>] [<b>-days arg</b>] [<b>-set_serial n</b>] [<b>-signkey filename</b>] [<b>-passin arg</b>] [<b>-x509toreq</b>] [<b>-req</b>] [<b>-CA filename</b>] [<b>-CAkey filename</b>] [<b>-CAcreateserial</b>] [<b>-CAserial filename</b>] [<b>-force_pubkey key</b>] [<b>-text</b>] [<b>-certopt option</b>] [<b>-C</b>] [<b>-[digest]</b>] [<b>-clrext</b>] [<b>-extfile filename</b>] [<b>-extensions section</b>] [<b>-engine id</b>]</p>

<h1 id="DESCRIPTION">DESCRIPTION</h1>

<p>The <b>x509</b> command is a multi purpose certificate utility. It can be used to display certificate information, convert certificates to various forms, sign certificate requests like a &quot;mini CA&quot; or edit certificate trust settings.</p>

<p>Since there are a large number of options they will split up into various sections.</p>

<p>x509&#x547D;&#x4EE4;&#x662F;&#x4E00;&#x4E2A;&#x591A;&#x7528;&#x9014;&#x8BC1;&#x4E66;&#x5B9E;&#x7528;&#x7A0B;&#x5E8F;&#x3002; &#x5B83;&#x53EF;&#x7528;&#x4E8E;&#x663E;&#x793A;&#x8BC1;&#x4E66;&#x4FE1;&#x606F;&#xFF0C;&#x5C06;&#x8BC1;&#x4E66;&#x8F6C;&#x6362;&#x4E3A;&#x5404;&#x79CD;&#x8868;&#x5355;&#xFF0C;&#x7B7E;&#x7F72;&#x8BF8;&#x5982;&ldquo;&#x8FF7;&#x4F60;CA&rdquo;&#x6216;&#x7F16;&#x8F91;&#x8BC1;&#x4E66;&#x4FE1;&#x4EFB;&#x8BBE;&#x7F6E;&#x7684;&#x8BC1;&#x4E66;&#x8BF7;&#x6C42;&#x3002;</p>

<p>&#x7531;&#x4E8E;&#x6709;&#x5927;&#x91CF;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x5B83;&#x4EEC;&#x5C06;&#x5206;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x90E8;&#x5206;&#x3002;</p>

<h1 id="OPTIONS">OPTIONS</h1>

<h2 id="Input-Output-and-General-Purpose-Options">Input, Output, and General Purpose Options</h2>

<dl>

<dt id="help"><b>-help</b></dt>
<dd>

<p>Print out a usage message.</p>

<p>&#x6253;&#x5370;&#x4F7F;&#x7528;&#x4FE1;&#x606F;&#x3002;</p>

</dd>
<dt id="inform-DER-PEM-NET"><b>-inform DER|PEM|NET</b></dt>
<dd>

<p>This specifies the input format normally the command will expect an X509 certificate but this can change if other options such as <b>-req</b> are present. The DER format is the DER encoding of the certificate and PEM is the base64 encoding of the DER encoding with header and footer lines added. The NET option is an obscure Netscape server format that is now obsolete.</p>

<p>&#x8FD9;&#x901A;&#x5E38;&#x6307;&#x5B9A;&#x547D;&#x4EE4;&#x5C06;&#x671F;&#x671B;X509&#x8BC1;&#x4E66;&#x7684;&#x8F93;&#x5165;&#x683C;&#x5F0F;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x5B58;&#x5728;&#x5176;&#x4ED6;&#x9009;&#x9879;&#xFF08;&#x5982;-req&#xFF09;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x66F4;&#x6539;&#x8BE5;&#x8F93;&#x5165;&#x683C;&#x5F0F;&#x3002; DER&#x683C;&#x5F0F;&#x662F;&#x8BC1;&#x4E66;&#x7684;DER&#x7F16;&#x7801;&#xFF0C;PEM&#x662F;&#x6DFB;&#x52A0;&#x4E86;&#x9875;&#x7709;&#x548C;&#x9875;&#x811A;&#x884C;&#x7684;DER&#x7F16;&#x7801;&#x7684;base64&#x7F16;&#x7801;&#x3002; NET&#x9009;&#x9879;&#x662F;&#x4E00;&#x4E2A;&#x6666;&#x6DA9;&#x7684;Netscape&#x670D;&#x52A1;&#x5668;&#x683C;&#x5F0F;&#xFF0C;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x8FC7;&#x65F6;&#x4E86;&#x3002;</p>

</dd>
<dt id="outform-DER-PEM-NET"><b>-outform DER|PEM|NET</b></dt>
<dd>

<p>This specifies the output format, the options have the same meaning as the <b>-inform</b> option.</p>

<p>&#x8FD9;&#x6307;&#x5B9A;&#x8F93;&#x51FA;&#x683C;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E9B;&#x9009;&#x9879;&#x4E0E;-inform&#x9009;&#x9879;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x542B;&#x4E49;&#x3002;</p>

</dd>
<dt id="in-filename"><b>-in filename</b></dt>
<dd>

<p>This specifies the input filename to read a certificate from or standard input if this option is not specified.</p>

<p>&#x5982;&#x679C;&#x672A;&#x6307;&#x5B9A;&#x6B64;&#x9009;&#x9879;&#xFF0C;&#x5219;&#x6307;&#x5B9A;&#x4ECE;&#x6216;&#x4ECE;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x8BFB;&#x53D6;&#x8BC1;&#x4E66;&#x7684;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x540D;&#x3002;</p>

</dd>
<dt id="out-filename"><b>-out filename</b></dt>
<dd>

<p>This specifies the output filename to write to or standard output by default.</p>

<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x6307;&#x5B9A;&#x8981;&#x5199;&#x5165;&#x7684;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#x540D;&#x6216;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#x3002;</p>

</dd>
<dt id="digest"><b>-[digest]</b></dt>
<dd>

<p>the digest to use. This affects any signing or display option that uses a message digest, such as the <b>-fingerprint</b>, <b>-signkey</b> and <b>-CA</b> options. Any digest supported by the GmSSL <b>dgst</b> command can be used. If not specified then SHA1 is used with <b>-fingerprint</b> or the default digest for the signing algorithm is used, typically SHA256.</p>

<p>&#x6D88;&#x5316;&#x4F7F;&#x7528;&#x3002; &#x8FD9;&#x4F1A;&#x5F71;&#x54CD;&#x4F7F;&#x7528;&#x6D88;&#x606F;&#x6458;&#x8981;&#x7684;&#x4EFB;&#x4F55;&#x7B7E;&#x540D;&#x6216;&#x663E;&#x793A;&#x9009;&#x9879;&#xFF0C;&#x4F8B;&#x5982;-fingerprint&#xFF0C;-signkey&#x548C;-CA&#x9009;&#x9879;&#x3002; &#x53EF;&#x4EE5;&#x4F7F;&#x7528;GmSSL dgst&#x547D;&#x4EE4;&#x652F;&#x6301;&#x7684;&#x4EFB;&#x4F55;&#x6458;&#x8981;&#x3002; &#x5982;&#x679C;&#x6CA1;&#x6709;&#x6307;&#x5B9A;&#xFF0C;&#x5219;SHA1&#x4E0E;-fingerprint&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;&#x7684;&#x9ED8;&#x8BA4;&#x6458;&#x8981;&#xFF0C;&#x901A;&#x5E38;&#x4E3A;SHA256&#x3002;</p>

</dd>
<dt id="engine-id"><b>-engine id</b></dt>
<dd>

<p>specifying an engine (by its unique <b>id</b> string) will cause <b>x509</b> to attempt to obtain a functional reference to the specified engine, thus initialising it if needed. The engine will then be set as the default for all available algorithms.</p>

<p>&#x6307;&#x5B9A;&#x5F15;&#x64CE;&#xFF08;&#x901A;&#x8FC7;&#x5176;&#x552F;&#x4E00;&#x7684;id&#x5B57;&#x7B26;&#x4E32;&#xFF09;&#x5C06;&#x5BFC;&#x81F4;x509&#x5C1D;&#x8BD5;&#x83B7;&#x53D6;&#x5BF9;&#x6307;&#x5B9A;&#x5F15;&#x64CE;&#x7684;&#x529F;&#x80FD;&#x5F15;&#x7528;&#xFF0C;&#x4ECE;&#x800C;&#x5728;&#x9700;&#x8981;&#x65F6;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#x3002; &#x7136;&#x540E;&#xFF0C;&#x5F15;&#x64CE;&#x5C06;&#x88AB;&#x8BBE;&#x7F6E;&#x4E3A;&#x6240;&#x6709;&#x53EF;&#x7528;&#x7B97;&#x6CD5;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#x3002;</p>

</dd>
</dl>

<h2 id="Display-Options">Display Options</h2>

<p>Note: the <b>-alias</b> and <b>-purpose</b> options are also display options but are described in the <b>TRUST SETTINGS</b> section.</p>

<p>&#x6CE8;&#x610F;&#xFF1A;-alias&#x548C;-purpose&#x9009;&#x9879;&#x4E5F;&#x662F;&#x663E;&#x793A;&#x9009;&#x9879;&#xFF0C;&#x4F46;&#x5728;&ldquo;&#x4FE1;&#x4EFB;&#x8BBE;&#x7F6E;&rdquo;&#x90E8;&#x5206;&#x4E2D;&#x6709;&#x4ECB;&#x7ECD;&#x3002;</p>

<dl>

<dt id="text"><b>-text</b></dt>
<dd>

<p>prints out the certificate in text form. Full details are output including the public key, signature algorithms, issuer and subject names, serial number any extensions present and any trust settings.</p>

<p>&#x4EE5;&#x6587;&#x672C;&#x5F62;&#x5F0F;&#x6253;&#x5370;&#x8BC1;&#x4E66;&#x3002; &#x8F93;&#x51FA;&#x5168;&#x90E8;&#x7EC6;&#x8282;&#xFF0C;&#x5305;&#x62EC;&#x516C;&#x94A5;&#xFF0C;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;&#xFF0C;&#x53D1;&#x884C;&#x4EBA;&#x548C;&#x4E3B;&#x9898;&#x540D;&#x79F0;&#xFF0C;&#x4EFB;&#x4F55;&#x6269;&#x5C55;&#x540D;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#x548C;&#x4EFB;&#x4F55;&#x4FE1;&#x4EFB;&#x8BBE;&#x7F6E;&#x3002;</p>

</dd>
<dt id="certopt-option"><b>-certopt option</b></dt>
<dd>

<p>customise the output format used with <b>-text</b>. The <b>option</b> argument can be a single option or multiple options separated by commas. The <b>-certopt</b> switch may be also be used more than once to set multiple options. See the <b>TEXT OPTIONS</b> section for more information.</p>

<p>&#x5B9A;&#x5236;&#x4E0E;-text&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x7684;&#x8F93;&#x51FA;&#x683C;&#x5F0F;&#x3002; &#x9009;&#x9879;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x662F;&#x5355;&#x4E2A;&#x9009;&#x9879;&#x6216;&#x591A;&#x4E2A;&#x9009;&#x9879;&#xFF0C;&#x4EE5;&#x9017;&#x53F7;&#x5206;&#x9694;&#x3002; &#x53EF;&#x4EE5;&#x4F7F;&#x7528;-certopt&#x5F00;&#x5173;&#x591A;&#x6B21;&#x8BBE;&#x7F6E;&#x591A;&#x4E2A;&#x9009;&#x9879;&#x3002; &#x6709;&#x5173;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;TEXT OPTIONS&#x90E8;&#x5206;&#x3002;</p>

</dd>
<dt id="noout"><b>-noout</b></dt>
<dd>

<p>this option prevents output of the encoded version of the request.</p>

<p>&#x6B64;&#x9009;&#x9879;&#x53EF;&#x9632;&#x6B62;&#x8BF7;&#x6C42;&#x7684;&#x7F16;&#x7801;&#x7248;&#x672C;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>

</dd>
<dt id="pubkey"><b>-pubkey</b></dt>
<dd>

<p>outputs the certificate&#39;s SubjectPublicKeyInfo block in PEM format.</p>

<p>&#x4EE5;PEM&#x683C;&#x5F0F;&#x8F93;&#x51FA;&#x8BC1;&#x4E66;&#x7684;SubjectPublicKeyInfo&#x5757;&#x3002;</p>

</dd>
<dt id="modulus"><b>-modulus</b></dt>
<dd>

<p>this option prints out the value of the modulus of the public key contained in the certificate.</p>

<p>&#x6B64;&#x9009;&#x9879;&#x6253;&#x5370;&#x8BC1;&#x4E66;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x516C;&#x94A5;&#x7684;&#x6A21;&#x6570;&#x503C;&#x3002;</p>

</dd>
<dt id="serial"><b>-serial</b></dt>
<dd>

<p>outputs the certificate serial number.</p>

<p>&#x8F93;&#x51FA;&#x8BC1;&#x4E66;&#x5E8F;&#x5217;&#x53F7;&#x3002;</p>

</dd>
<dt id="subject_hash"><b>-subject_hash</b></dt>
<dd>

<p>outputs the &quot;hash&quot; of the certificate subject name. This is used in GmSSL to form an index to allow certificates in a directory to be looked up by subject name.</p>

<p>&#x8F93;&#x51FA;&#x8BC1;&#x4E66;&#x4E3B;&#x9898;&#x540D;&#x79F0;&#x7684;&ldquo;&#x54C8;&#x5E0C;&rdquo;&#x3002; &#x8FD9;&#x5728;GmSSL&#x4E2D;&#x7528;&#x4E8E;&#x5F62;&#x6210;&#x7D22;&#x5F15;&#xFF0C;&#x4EE5;&#x5141;&#x8BB8;&#x4EE5;&#x4E3B;&#x9898;&#x540D;&#x79F0;&#x67E5;&#x627E;&#x76EE;&#x5F55;&#x4E2D;&#x7684;&#x8BC1;&#x4E66;&#x3002;</p>

</dd>
<dt id="issuer_hash"><b>-issuer_hash</b></dt>
<dd>

<p>outputs the &quot;hash&quot; of the certificate issuer name.</p>

<p>&#x8F93;&#x51FA;&#x8BC1;&#x4E66;&#x9881;&#x53D1;&#x8005;&#x540D;&#x79F0;&#x7684;&ldquo;&#x54C8;&#x5E0C;&rdquo;&#x3002;</p>

</dd>
<dt id="ocspid"><b>-ocspid</b></dt>
<dd>

<p>outputs the OCSP hash values for the subject name and public key.</p>

<p>&#x8F93;&#x51FA;&#x4E3B;&#x9898;&#x540D;&#x79F0;&#x548C;&#x516C;&#x94A5;&#x7684;OCSP&#x54C8;&#x5E0C;&#x503C;&#x3002;</p>

</dd>
<dt id="hash"><b>-hash</b></dt>
<dd>

<p>synonym for &quot;-subject_hash&quot; for backward compatibility reasons.</p>

<p>&ldquo;-subject_hash&rdquo;&#x7684;&#x540C;&#x4E49;&#x8BCD;&#x7531;&#x4E8E;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x6027;&#x539F;&#x56E0;&#x3002;</p>

</dd>
<dt id="subject_hash_old"><b>-subject_hash_old</b></dt>
<dd>

<p>outputs the &quot;hash&quot; of the certificate subject name using the older algorithm as used by GmSSL versions before 1.0.0.</p>

<p>&#x4F7F;&#x7528;1.0.0&#x4E4B;&#x524D;&#x7684;GmSSL&#x7248;&#x672C;&#x4F7F;&#x7528;&#x7684;&#x65E7;&#x7B97;&#x6CD5;&#x8F93;&#x51FA;&#x8BC1;&#x4E66;&#x4E3B;&#x9898;&#x540D;&#x79F0;&#x7684;&ldquo;&#x54C8;&#x5E0C;&rdquo;&#x3002;</p>

</dd>
<dt id="issuer_hash_old"><b>-issuer_hash_old</b></dt>
<dd>

<p>outputs the &quot;hash&quot; of the certificate issuer name using the older algorithm as used by GmSSL versions before 1.0.0.</p>

<p>&#x4F7F;&#x7528;1.0.0&#x4E4B;&#x524D;&#x7684;GmSSL&#x7248;&#x672C;&#x4F7F;&#x7528;&#x7684;&#x65E7;&#x7B97;&#x6CD5;&#x8F93;&#x51FA;&#x8BC1;&#x4E66;&#x9881;&#x53D1;&#x8005;&#x540D;&#x79F0;&#x7684;&ldquo;&#x54C8;&#x5E0C;&rdquo;&#x3002;</p>

</dd>
<dt id="subject"><b>-subject</b></dt>
<dd>

<p>outputs the subject name.</p>

<p>&#x8F93;&#x51FA;&#x4E3B;&#x9898;&#x540D;&#x79F0;&#x3002;</p>

</dd>
<dt id="issuer"><b>-issuer</b></dt>
<dd>

<p>outputs the issuer name.</p>

<p>&#x8F93;&#x51FA;&#x9881;&#x53D1;&#x8005;&#x540D;&#x79F0;&#x3002;</p>

</dd>
<dt id="nameopt-option"><b>-nameopt option</b></dt>
<dd>

<p>option which determines how the subject or issuer names are displayed. The <b>option</b> argument can be a single option or multiple options separated by commas. Alternatively the <b>-nameopt</b> switch may be used more than once to set multiple options. See the <b>NAME OPTIONS</b> section for more information.</p>

<p>&#x8BE5;&#x9009;&#x9879;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x4E3B;&#x9898;&#x6216;&#x53D1;&#x884C;&#x8005;&#x540D;&#x79F0;&#x7684;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x3002; &#x9009;&#x9879;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x662F;&#x5355;&#x4E2A;&#x9009;&#x9879;&#x6216;&#x591A;&#x4E2A;&#x9009;&#x9879;&#xFF0C;&#x4EE5;&#x9017;&#x53F7;&#x5206;&#x9694;&#x3002; &#x6216;&#x8005;&#xFF0C;-nameopt&#x5F00;&#x5173;&#x53EF;&#x4EE5;&#x88AB;&#x591A;&#x6B21;&#x4F7F;&#x7528;&#x4EE5;&#x8BBE;&#x7F6E;&#x591A;&#x4E2A;&#x9009;&#x9879;&#x3002; &#x6709;&#x5173;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&ldquo;NAME OPTIONS&rdquo;&#x90E8;&#x5206;&#x3002;</p>

</dd>
<dt id="email"><b>-email</b></dt>
<dd>

<p>outputs the email address(es) if any.</p>

<p>&#x8F93;&#x51FA;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5730;&#x5740;&#xFF08;&#x5982;&#x679C;&#x6709;&#xFF09;&#x3002;</p>

</dd>
<dt id="ocsp_uri"><b>-ocsp_uri</b></dt>
<dd>

<p>outputs the OCSP responder address(es) if any.</p>

<p>&#x8F93;&#x51FA;OCSP&#x54CD;&#x5E94;&#x8005;&#x5730;&#x5740;&#xFF08;&#x5982;&#x679C;&#x6709;&#xFF09;&#x3002;</p>

</dd>
<dt id="startdate"><b>-startdate</b></dt>
<dd>

<p>prints out the start date of the certificate, that is the notBefore date.</p>

<p>&#x6253;&#x5370;&#x8BC1;&#x4E66;&#x7684;&#x5F00;&#x59CB;&#x65E5;&#x671F;&#xFF0C;&#x5373;notBefore&#x65E5;&#x671F;&#x3002;</p>

</dd>
<dt id="enddate"><b>-enddate</b></dt>
<dd>

<p>prints out the expiry date of the certificate, that is the notAfter date.</p>

<p>&#x6253;&#x5370;&#x8BC1;&#x4E66;&#x7684;&#x5230;&#x671F;&#x65E5;&#x671F;&#xFF0C;&#x5373;notAfter&#x65E5;&#x671F;&#x3002;</p>

</dd>
<dt id="dates"><b>-dates</b></dt>
<dd>

<p>prints out the start and expiry dates of a certificate.</p>

<p>&#x6253;&#x5370;&#x8BC1;&#x4E66;&#x7684;&#x5F00;&#x59CB;&#x548C;&#x5230;&#x671F;&#x65E5;&#x671F;&#x3002;</p>

</dd>
<dt id="checkend-arg"><b>-checkend arg</b></dt>
<dd>

<p>checks if the certificate expires within the next <b>arg</b> seconds and exits non-zero if yes it will expire or zero if not.</p>

<p>&#x68C0;&#x67E5;&#x8BC1;&#x4E66;&#x662F;&#x5426;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;arg&#x79D2;&#x5185;&#x5230;&#x671F;&#xFF0C;&#x5982;&#x679C;&#x662F;&#xFF0C;&#x5219;&#x9000;&#x51FA;&#x975E;&#x96F6;&#xFF0C;&#x5426;&#x5219;&#x4E3A;&#x96F6;&#x3002;</p>

</dd>
<dt id="fingerprint"><b>-fingerprint</b></dt>
<dd>

<p>prints out the digest of the DER encoded version of the whole certificate (see digest options).</p>

<p>&#x6253;&#x5370;&#x6574;&#x4E2A;&#x8BC1;&#x4E66;&#x7684;DER&#x7F16;&#x7801;&#x7248;&#x672C;&#x7684;&#x6458;&#x8981;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x6458;&#x8981;&#x9009;&#x9879;&#xFF09;&#x3002;</p>

</dd>
<dt id="C"><b>-C</b></dt>
<dd>

<p>this outputs the certificate in the form of a C source file.</p>

<p>&#x8FD9;&#x5C06;&#x4EE5;C&#x6E90;&#x6587;&#x4EF6;&#x7684;&#x5F62;&#x5F0F;&#x8F93;&#x51FA;&#x8BC1;&#x4E66;&#x3002;</p>

</dd>
</dl>

<h2 id="Trust-Settings">Trust Settings</h2>

<p>A <b>trusted certificate</b> is an ordinary certificate which has several additional pieces of information attached to it such as the permitted and prohibited uses of the certificate and an &quot;alias&quot;.</p>

<p>Normally when a certificate is being verified at least one certificate must be &quot;trusted&quot;. By default a trusted certificate must be stored locally and must be a root CA: any certificate chain ending in this CA is then usable for any purpose.</p>

<p>Trust settings currently are only used with a root CA. They allow a finer control over the purposes the root CA can be used for. For example a CA may be trusted for SSL client but not SSL server use.</p>

<p>See the description of the <b>verify</b> utility for more information on the meaning of trust settings.</p>

<p>Future versions of GmSSL will recognize trust settings on any certificate: not just root CAs.</p>

<p>&#x53D7;&#x4FE1;&#x4EFB;&#x7684;&#x8BC1;&#x4E66;&#x662F;&#x666E;&#x901A;&#x8BC1;&#x4E66;&#xFF0C;&#x5176;&#x4E2D;&#x9644;&#x6709;&#x6570;&#x4E2A;&#x9644;&#x52A0;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x8BC1;&#x4E66;&#x7684;&#x8BB8;&#x53EF;&#x548C;&#x7981;&#x6B62;&#x4F7F;&#x7528;&#x4EE5;&#x53CA;&ldquo;&#x522B;&#x540D;&rdquo;&#x3002;</p>

<p>&#x901A;&#x5E38;&#x5F53;&#x8BC1;&#x4E66;&#x88AB;&#x8BC1;&#x5B9E;&#x65F6;&#xFF0C;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x8BC1;&#x4E66;&#x5FC5;&#x987B;&#x662F;&ldquo;&#x53EF;&#x4FE1;&#x4EFB;&#x7684;&rdquo;&#x3002; &#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53D7;&#x4FE1;&#x4EFB;&#x7684;&#x8BC1;&#x4E66;&#x5FC5;&#x987B;&#x5728;&#x672C;&#x5730;&#x5B58;&#x50A8;&#xFF0C;&#x5E76;&#x4E14;&#x5FC5;&#x987B;&#x662F;&#x6839;CA&#xFF1A;&#x4EFB;&#x4F55;&#x4EE5;CA&#x4E3A;&#x7ED3;&#x5C3E;&#x7684;&#x8BC1;&#x4E66;&#x94FE;&#x53EF;&#x7528;&#x4E8E;&#x4EFB;&#x4F55;&#x76EE;&#x7684;&#x3002;</p>

<p>&#x76EE;&#x524D;&#x7684;&#x4FE1;&#x4EFB;&#x8BBE;&#x7F6E;&#x4EC5;&#x4E0E;&#x6839;CA&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x3002; &#x5B83;&#x4EEC;&#x5141;&#x8BB8;&#x5BF9;&#x6839;CA&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&#x76EE;&#x7684;&#x8FDB;&#x884C;&#x66F4;&#x7CBE;&#x7EC6;&#x7684;&#x63A7;&#x5236;&#x3002; &#x4F8B;&#x5982;&#xFF0C;CA&#x53EF;&#x80FD;&#x88AB;&#x4FE1;&#x4EFB;&#x4E3A;SSL&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;SSL&#x670D;&#x52A1;&#x5668;&#x3002;</p>

<p>&#x6709;&#x5173;&#x4FE1;&#x4EFB;&#x8BBE;&#x7F6E;&#x7684;&#x542B;&#x4E49;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x9A8C;&#x8BC1;&#x5B9E;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x8BF4;&#x660E;&#x3002;</p>

<p>&#x672A;&#x6765;&#x7248;&#x672C;&#x7684;GmSSL&#x5C06;&#x4F1A;&#x8BC6;&#x522B;&#x4EFB;&#x4F55;&#x8BC1;&#x4E66;&#x4E0A;&#x7684;&#x4FE1;&#x4EFB;&#x8BBE;&#x7F6E;&#xFF1A;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6839;CA&#x3002;</p>

<dl>

<dt id="trustout"><b>-trustout</b></dt>
<dd>

<p>this causes <b>x509</b> to output a <b>trusted</b> certificate. An ordinary or trusted certificate can be input but by default an ordinary certificate is output and any trust settings are discarded. With the <b>-trustout</b> option a trusted certificate is output. A trusted certificate is automatically output if any trust settings are modified.</p>

<p>&#x8FD9;&#x5BFC;&#x81F4;x509&#x8F93;&#x51FA;&#x53EF;&#x4FE1;&#x8BC1;&#x4E66;&#x3002; &#x53EF;&#x4EE5;&#x8F93;&#x5165;&#x666E;&#x901A;&#x6216;&#x53EF;&#x4FE1;&#x4EFB;&#x7684;&#x8BC1;&#x4E66;&#xFF0C;&#x4F46;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x8F93;&#x51FA;&#x666E;&#x901A;&#x8BC1;&#x4E66;&#xFF0C;&#x5E76;&#x4E22;&#x5F03;&#x4EFB;&#x4F55;&#x4FE1;&#x4EFB;&#x8BBE;&#x7F6E;&#x3002; &#x4F7F;&#x7528;-trustout&#x9009;&#x9879;&#xFF0C;&#x8F93;&#x51FA;&#x53EF;&#x4FE1;&#x8BC1;&#x4E66;&#x3002; &#x5982;&#x679C;&#x4EFB;&#x4F55;&#x4FE1;&#x4EFB;&#x8BBE;&#x7F6E;&#x88AB;&#x4FEE;&#x6539;&#xFF0C;&#x5C06;&#x81EA;&#x52A8;&#x8F93;&#x51FA;&#x53D7;&#x4FE1;&#x4EFB;&#x7684;&#x8BC1;&#x4E66;&#x3002;</p>

</dd>
<dt id="setalias-arg"><b>-setalias arg</b></dt>
<dd>

<p>sets the alias of the certificate. This will allow the certificate to be referred to using a nickname for example &quot;Steve&#39;s Certificate&quot;.</p>

<p>&#x8BBE;&#x7F6E;&#x8BC1;&#x4E66;&#x7684;&#x522B;&#x540D;&#x3002; &#x8FD9;&#x5C06;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x6635;&#x79F0;&#x6765;&#x5F15;&#x7528;&#x8BC1;&#x4E66;&#xFF0C;&#x4F8B;&#x5982;&ldquo;Steve&#39;s Certificate&rdquo;&#x3002;</p>

</dd>
<dt id="alias"><b>-alias</b></dt>
<dd>

<p>outputs the certificate alias, if any.</p>

<p>&#x8F93;&#x51FA;&#x8BC1;&#x4E66;&#x522B;&#x540D;&#xFF08;&#x5982;&#x679C;&#x6709;&#xFF09;&#x3002;</p>

</dd>
<dt id="clrtrust"><b>-clrtrust</b></dt>
<dd>

<p>clears all the permitted or trusted uses of the certificate.</p>

<p>&#x6E05;&#x9664;&#x8BC1;&#x4E66;&#x7684;&#x6240;&#x6709;&#x5141;&#x8BB8;&#x6216;&#x53D7;&#x4FE1;&#x4EFB;&#x7684;&#x7528;&#x9014;&#x3002;</p>

</dd>
<dt id="clrreject"><b>-clrreject</b></dt>
<dd>

<p>clears all the prohibited or rejected uses of the certificate.</p>

<p>&#x6E05;&#x9664;&#x8BC1;&#x4E66;&#x7684;&#x6240;&#x6709;&#x7981;&#x6B62;&#x6216;&#x62D2;&#x7EDD;&#x7684;&#x4F7F;&#x7528;&#x3002;</p>

</dd>
<dt id="addtrust-arg"><b>-addtrust arg</b></dt>
<dd>

<p>adds a trusted certificate use. Any object name can be used here but currently only <b>clientAuth</b> (SSL client use), <b>serverAuth</b> (SSL server use), <b>emailProtection</b> (S/MIME email) and <b>anyExtendedKeyUsage</b> are used. As of GmSSL 1.1.0, the last of these blocks all purposes when rejected or enables all purposes when trusted. Other GmSSL applications may define additional uses.</p>

<p>&#x6DFB;&#x52A0;&#x53EF;&#x4FE1;&#x8BC1;&#x4E66;&#x4F7F;&#x7528;&#x3002; &#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#x540D;&#x79F0;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x76EE;&#x524D;&#x53EA;&#x4F7F;&#x7528;clientAuth&#xFF08;SSL&#x5BA2;&#x6237;&#x7AEF;&#x4F7F;&#x7528;&#xFF09;&#xFF0C;serverAuth&#xFF08;SSL&#x670D;&#x52A1;&#x5668;&#x4F7F;&#x7528;&#xFF09;&#xFF0C;emailProtection&#xFF08;S / MIME&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#xFF09;&#x548C;anyExtendedKeyUsage&#x3002; &#x4ECE;GmSSL 1.1.0&#x5F00;&#x59CB;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5C06;&#x88AB;&#x62D2;&#x7EDD;&#x6216;&#x5728;&#x53D7;&#x4FE1;&#x4EFB;&#x65F6;&#x4F7F;&#x6240;&#x6709;&#x76EE;&#x7684;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#x3002; &#x5176;&#x4ED6;GmSSL&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x4F1A;&#x5B9A;&#x4E49;&#x5176;&#x4ED6;&#x7528;&#x9014;&#x3002;</p>

</dd>
<dt id="addreject-arg"><b>-addreject arg</b></dt>
<dd>

<p>adds a prohibited use. It accepts the same values as the <b>-addtrust</b> option.</p>

<p>&#x589E;&#x52A0;&#x7981;&#x6B62;&#x4F7F;&#x7528;&#x3002; &#x5B83;&#x63A5;&#x53D7;&#x4E0E;-addtrust&#x9009;&#x9879;&#x76F8;&#x540C;&#x7684;&#x503C;&#x3002;</p>

</dd>
<dt id="purpose"><b>-purpose</b></dt>
<dd>

<p>this option performs tests on the certificate extensions and outputs the results. For a more complete description see the <b>CERTIFICATE EXTENSIONS</b> section.</p>

<p>&#x6B64;&#x9009;&#x9879;&#x5BF9;&#x8BC1;&#x4E66;&#x6269;&#x5C55;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x5E76;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x3002; &#x6709;&#x5173;&#x66F4;&#x5B8C;&#x6574;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;CERTIFICATE EXTENSIONS&#x90E8;&#x5206;&#x3002;</p>

</dd>
</dl>

<h2 id="Signing-Options">Signing Options</h2>

<p>The <b>x509</b> utility can be used to sign certificates and requests: it can thus behave like a &quot;mini CA&quot;.</p>

<p>x509&#x5B9E;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x7528;&#x4E8E;&#x7B7E;&#x7F72;&#x8BC1;&#x4E66;&#x548C;&#x8BF7;&#x6C42;&#xFF1A;&#x5B83;&#x50CF;&ldquo;&#x8FF7;&#x4F60;CA&rdquo;</p>

<dl>

<dt id="signkey-filename"><b>-signkey filename</b></dt>
<dd>

<p>this option causes the input file to be self signed using the supplied private key.</p>

<p>If the input file is a certificate it sets the issuer name to the subject name (i.e. makes it self signed) changes the public key to the supplied value and changes the start and end dates. The start date is set to the current time and the end date is set to a value determined by the <b>-days</b> option. Any certificate extensions are retained unless the <b>-clrext</b> option is supplied; this includes, for example, any existing key identifier extensions.</p>

<p>If the input is a certificate request then a self signed certificate is created using the supplied private key using the subject name in the request.</p>

<p>&#x6B64;&#x9009;&#x9879;&#x5C06;&#x4F7F;&#x7528;&#x63D0;&#x4F9B;&#x7684;&#x79C1;&#x94A5;&#x5BF9;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x81EA;&#x7B7E;&#x540D;&#x3002;</p>

<p>&#x5982;&#x679C;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x662F;&#x8BC1;&#x4E66;&#xFF0C;&#x5219;&#x5C06;&#x53D1;&#x884C;&#x4EBA;&#x540D;&#x79F0;&#x8BBE;&#x7F6E;&#x4E3A;&#x4E3B;&#x9898;&#x540D;&#x79F0;&#xFF08;&#x5373;&#x4F7F;&#x5176;&#x81EA;&#x7B7E;&#x540D;&#xFF09;&#x5C06;&#x516C;&#x94A5;&#x66F4;&#x6539;&#x4E3A;&#x63D0;&#x4F9B;&#x7684;&#x503C;&#xFF0C;&#x5E76;&#x66F4;&#x6539;&#x5F00;&#x59CB;&#x548C;&#x7ED3;&#x675F;&#x65E5;&#x671F;&#x3002; &#x5F00;&#x59CB;&#x65E5;&#x671F;&#x8BBE;&#x7F6E;&#x4E3A;&#x5F53;&#x524D;&#x65F6;&#x95F4;&#xFF0C;&#x7ED3;&#x675F;&#x65E5;&#x671F;&#x8BBE;&#x7F6E;&#x4E3A;&#x7531;-days&#x9009;&#x9879;&#x786E;&#x5B9A;&#x7684;&#x503C;&#x3002; &#x9664;&#x975E;&#x63D0;&#x4F9B;&#x4E86;-clrext&#x9009;&#x9879;&#xFF0C;&#x5426;&#x5219;&#x5C06;&#x4FDD;&#x7559;&#x4EFB;&#x4F55;&#x8BC1;&#x4E66;&#x6269;&#x5C55;&#x540D;; &#x8FD9;&#x5305;&#x62EC;&#x4F8B;&#x5982;&#x4EFB;&#x4F55;&#x73B0;&#x6709;&#x7684;&#x5BC6;&#x94A5;&#x6807;&#x8BC6;&#x7B26;&#x6269;&#x5C55;&#x3002;</p>

<p>&#x5982;&#x679C;&#x8F93;&#x5165;&#x662F;&#x8BC1;&#x4E66;&#x8BF7;&#x6C42;&#xFF0C;&#x5219;&#x4F7F;&#x7528;&#x63D0;&#x4F9B;&#x7684;&#x79C1;&#x94A5;&#x4F7F;&#x7528;&#x8BF7;&#x6C42;&#x4E2D;&#x7684;&#x4E3B;&#x9898;&#x540D;&#x79F0;&#x521B;&#x5EFA;&#x81EA;&#x7B7E;&#x540D;&#x8BC1;&#x4E66;&#x3002;</p>

</dd>
<dt id="passin-arg"><b>-passin arg</b></dt>
<dd>

<p>the key password source. For more information about the format of <b>arg</b> see the <b>PASS PHRASE ARGUMENTS</b> section in <a href="../man1/gmssl.html">gmssl(1)</a>.</p>

<p>&#x5BC6;&#x7801;&#x5BC6;&#x7801;&#x6765;&#x6E90;&#x3002; &#x6709;&#x5173;arg&#x683C;&#x5F0F;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;gmssl&#xFF08;1&#xFF09;&#x4E2D;&#x7684;PASS PHRASE ARGUMENTS&#x90E8;&#x5206;&#x3002;</p>

</dd>
<dt id="clrext"><b>-clrext</b></dt>
<dd>

<p>delete any extensions from a certificate. This option is used when a certificate is being created from another certificate (for example with the <b>-signkey</b> or the <b>-CA</b> options). Normally all extensions are retained.</p>

<p>&#x4ECE;&#x8BC1;&#x4E66;&#x4E2D;&#x5220;&#x9664;&#x4EFB;&#x4F55;&#x6269;&#x5C55;&#x540D;&#x3002; &#x5F53;&#x4ECE;&#x53E6;&#x4E00;&#x4E2A;&#x8BC1;&#x4E66;&#x521B;&#x5EFA;&#x8BC1;&#x4E66;&#x65F6;&#x4F7F;&#x7528;&#x6B64;&#x9009;&#x9879;&#xFF08;&#x4F8B;&#x5982;&#x4F7F;&#x7528;-signkey&#x6216;-CA&#x9009;&#x9879;&#xFF09;&#x3002; &#x901A;&#x5E38;&#x6240;&#x6709;&#x7684;&#x6269;&#x5C55;&#x90FD;&#x4FDD;&#x7559;&#x3002;</p>

</dd>
<dt id="keyform-PEM-DER"><b>-keyform PEM|DER</b></dt>
<dd>

<p>specifies the format (DER or PEM) of the private key file used in the <b>-signkey</b> option.</p>

<p>&#x6307;&#x5B9A;-signkey&#x9009;&#x9879;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x79C1;&#x94A5;&#x6587;&#x4EF6;&#x7684;&#x683C;&#x5F0F;&#xFF08;DER&#x6216;PEM&#xFF09;&#x3002;</p>

</dd>
<dt id="days-arg"><b>-days arg</b></dt>
<dd>

<p>specifies the number of days to make a certificate valid for. The default is 30 days.</p>

<p>&#x6307;&#x5B9A;&#x4F7F;&#x8BC1;&#x4E66;&#x6709;&#x6548;&#x7684;&#x5929;&#x6570;&#x3002; &#x9ED8;&#x8BA4;&#x4E3A;30&#x5929;&#x3002;</p>

</dd>
<dt id="x509toreq"><b>-x509toreq</b></dt>
<dd>

<p>converts a certificate into a certificate request. The <b>-signkey</b> option is used to pass the required private key.</p>

<p>&#x5C06;&#x8BC1;&#x4E66;&#x8F6C;&#x6362;&#x4E3A;&#x8BC1;&#x4E66;&#x8BF7;&#x6C42;&#x3002; -signkey&#x9009;&#x9879;&#x7528;&#x4E8E;&#x4F20;&#x9012;&#x6240;&#x9700;&#x7684;&#x79C1;&#x94A5;&#x3002;</p>

</dd>
<dt id="req"><b>-req</b></dt>
<dd>

<p>by default a certificate is expected on input. With this option a certificate request is expected instead.</p>

<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9884;&#x671F;&#x8F93;&#x5165;&#x8BC1;&#x4E66;&#x3002; &#x4F7F;&#x7528;&#x6B64;&#x9009;&#x9879;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8BC1;&#x4E66;&#x8BF7;&#x6C42;&#x3002;</p>

</dd>
<dt id="set_serial-n"><b>-set_serial n</b></dt>
<dd>

<p>specifies the serial number to use. This option can be used with either the <b>-signkey</b> or <b>-CA</b> options. If used in conjunction with the <b>-CA</b> option the serial number file (as specified by the <b>-CAserial</b> or <b>-CAcreateserial</b> options) is not used.</p>

<p>The serial number can be decimal or hex (if preceded by <b>0x</b>).</p>

<p>&#x6307;&#x5B9A;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#x3002; &#x6B64;&#x9009;&#x9879;&#x53EF;&#x4E0E;-signkey&#x6216;-CA&#x9009;&#x9879;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x3002; &#x5982;&#x679C;&#x4E0E;-CA&#x9009;&#x9879;&#x7ED3;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x5219;&#x4E0D;&#x4F7F;&#x7528;&#x5E8F;&#x5217;&#x53F7;&#x6587;&#x4EF6;&#xFF08;&#x7531;-CAserial&#x6216;-CAcreateserial&#x9009;&#x9879;&#x6307;&#x5B9A;&#xFF09;&#x3002;</p>

<p>&#x5E8F;&#x5217;&#x53F7;&#x53EF;&#x4EE5;&#x662F;&#x5341;&#x8FDB;&#x5236;&#x6216;&#x5341;&#x516D;&#x8FDB;&#x5236;&#xFF08;&#x5982;&#x679C;&#x524D;&#x9762;&#x662F;0x&#xFF09;&#x3002;</p>

</dd>
<dt id="CA-filename"><b>-CA filename</b></dt>
<dd>

<p>specifies the CA certificate to be used for signing. When this option is present <b>x509</b> behaves like a &quot;mini CA&quot;. The input file is signed by this CA using this option: that is its issuer name is set to the subject name of the CA and it is digitally signed using the CAs private key.</p>

<p>This option is normally combined with the <b>-req</b> option. Without the <b>-req</b> option the input is a certificate which must be self signed.</p>

<p>&#x6307;&#x5B9A;&#x8981;&#x7528;&#x4E8E;&#x7B7E;&#x540D;&#x7684;CA&#x8BC1;&#x4E66;&#x3002; &#x5F53;&#x6B64;&#x9009;&#x9879;&#x5B58;&#x5728;&#x65F6;&#xFF0C;x509&#x7684;&#x884C;&#x4E3A;&#x5C31;&#x50CF;&ldquo;&#x8FF7;&#x4F60;CA&rdquo;&#x3002; &#x8BE5;CA&#x4F7F;&#x7528;&#x6B64;&#x9009;&#x9879;&#x5BF9;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#xFF1A;&#x5373;&#x5C06;&#x5176;&#x9881;&#x53D1;&#x8005;&#x540D;&#x79F0;&#x8BBE;&#x7F6E;&#x4E3A;CA&#x7684;&#x4E3B;&#x9898;&#x540D;&#x79F0;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;CAs&#x79C1;&#x94A5;&#x8FDB;&#x884C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x3002;</p>

<p>&#x6B64;&#x9009;&#x9879;&#x901A;&#x5E38;&#x4E0E;-req&#x9009;&#x9879;&#x7EC4;&#x5408;&#x3002; &#x6CA1;&#x6709;-req&#x9009;&#x9879;&#xFF0C;&#x8F93;&#x5165;&#x662F;&#x5FC5;&#x987B;&#x662F;&#x81EA;&#x7B7E;&#x540D;&#x7684;&#x8BC1;&#x4E66;&#x3002;</p>

</dd>
<dt id="CAkey-filename"><b>-CAkey filename</b></dt>
<dd>

<p>sets the CA private key to sign a certificate with. If this option is not specified then it is assumed that the CA private key is present in the CA certificate file.</p>

<p>&#x8BBE;&#x7F6E;CA&#x79C1;&#x94A5;&#x4EE5;&#x7B7E;&#x7F72;&#x8BC1;&#x4E66;&#x3002; &#x5982;&#x679C;&#x672A;&#x6307;&#x5B9A;&#x6B64;&#x9009;&#x9879;&#xFF0C;&#x5219;&#x5047;&#x5B9A;CA&#x79C1;&#x94A5;&#x5B58;&#x5728;&#x4E8E;CA&#x8BC1;&#x4E66;&#x6587;&#x4EF6;&#x4E2D;&#x3002;</p>

</dd>
<dt id="CAserial-filename"><b>-CAserial filename</b></dt>
<dd>

<p>sets the CA serial number file to use.</p>

<p>When the <b>-CA</b> option is used to sign a certificate it uses a serial number specified in a file. This file consist of one line containing an even number of hex digits with the serial number to use. After each use the serial number is incremented and written out to the file again.</p>

<p>The default filename consists of the CA certificate file base name with &quot;.srl&quot; appended. For example if the CA certificate file is called &quot;mycacert.pem&quot; it expects to find a serial number file called &quot;mycacert.srl&quot;.</p>

<p>&#x8BBE;&#x7F6E;&#x8981;&#x4F7F;&#x7528;&#x7684;CA&#x5E8F;&#x5217;&#x53F7;&#x6587;&#x4EF6;&#x3002;</p>

<p>&#x5F53;-CA&#x9009;&#x9879;&#x7528;&#x4E8E;&#x7B7E;&#x7F72;&#x8BC1;&#x4E66;&#x65F6;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x6587;&#x4EF6;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#x3002; &#x8BE5;&#x6587;&#x4EF6;&#x5305;&#x542B;&#x4E00;&#x884C;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x4F7F;&#x7528;&#x5E8F;&#x5217;&#x53F7;&#x7684;&#x5076;&#x6570;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#x3002; &#x6BCF;&#x6B21;&#x4F7F;&#x7528;&#x540E;&#xFF0C;&#x5E8F;&#x5217;&#x53F7;&#x5C06;&#x589E;&#x52A0;&#x5E76;&#x518D;&#x6B21;&#x5199;&#x5165;&#x6587;&#x4EF6;&#x3002;</p>

<p>&#x9ED8;&#x8BA4;&#x6587;&#x4EF6;&#x540D;&#x7531;&#x9644;&#x52A0;&#x4E86;&ldquo;.srl&rdquo;&#x7684;CA&#x8BC1;&#x4E66;&#x6587;&#x4EF6;&#x57FA;&#x7840;&#x540D;&#x79F0;&#x7EC4;&#x6210;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;CA&#x8BC1;&#x4E66;&#x6587;&#x4EF6;&#x88AB;&#x79F0;&#x4E3A;&ldquo;mycacert.pem&rdquo;&#xFF0C;&#x5219;&#x5B83;&#x5E0C;&#x671B;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;&ldquo;mycacert.srl&rdquo;&#x7684;&#x5E8F;&#x5217;&#x53F7;&#x6587;&#x4EF6;&#x3002;</p>

</dd>
<dt id="CAcreateserial"><b>-CAcreateserial</b></dt>
<dd>

<p>with this option the CA serial number file is created if it does not exist: it will contain the serial number &quot;02&quot; and the certificate being signed will have the 1 as its serial number. If the <b>-CA</b> option is specified and the serial number file does not exist a random number is generated; this is the recommended practice.</p>

<p>&#x4F7F;&#x7528;&#x6B64;&#x9009;&#x9879;&#xFF0C;CA&#x5E8F;&#x5217;&#x53F7;&#x6587;&#x4EF6;&#x4E0D;&#x5B58;&#x5728;&#x65F6;&#x5C06;&#x88AB;&#x521B;&#x5EFA;&#xFF1A;&#x5B83;&#x5C06;&#x5305;&#x542B;&#x5E8F;&#x5217;&#x53F7;&ldquo;02&rdquo;&#xFF0C;&#x6B63;&#x5728;&#x7B7E;&#x540D;&#x7684;&#x8BC1;&#x4E66;&#x5C06;&#x5177;&#x6709;1&#x4F5C;&#x4E3A;&#x5176;&#x5E8F;&#x5217;&#x53F7;&#x3002; &#x5982;&#x679C;&#x6307;&#x5B9A;&#x4E86;-CA&#x9009;&#x9879;&#xFF0C;&#x5E76;&#x4E14;&#x5E8F;&#x5217;&#x53F7;&#x6587;&#x4EF6;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x5219;&#x751F;&#x6210;&#x968F;&#x673A;&#x6570;; &#x8FD9;&#x662F;&#x63A8;&#x8350;&#x7684;&#x505A;&#x6CD5;&#x3002;</p>

</dd>
<dt id="extfile-filename"><b>-extfile filename</b></dt>
<dd>

<p>file containing certificate extensions to use. If not specified then no extensions are added to the certificate.</p>

<p>&#x5305;&#x542B;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x8BC1;&#x4E66;&#x6269;&#x5C55;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x3002; &#x5982;&#x679C;&#x672A;&#x6307;&#x5B9A;&#xFF0C;&#x5219;&#x4E0D;&#x4F1A;&#x5C06;&#x4EFB;&#x4F55;&#x6269;&#x5C55;&#x540D;&#x6DFB;&#x52A0;&#x5230;&#x8BC1;&#x4E66;&#x3002;</p>

</dd>
<dt id="extensions-section"><b>-extensions section</b></dt>
<dd>

<p>the section to add certificate extensions from. If this option is not specified then the extensions should either be contained in the unnamed (default) section or the default section should contain a variable called &quot;extensions&quot; which contains the section to use. See the <a href="../man5/x509v3_config.html">x509v3_config(5)</a> manual page for details of the extension section format.</p>

<p>&#x4ECE;&#x4E2D;&#x6DFB;&#x52A0;&#x8BC1;&#x4E66;&#x6269;&#x5C55;&#x7684;&#x90E8;&#x5206;&#x3002; &#x5982;&#x679C;&#x672A;&#x6307;&#x5B9A;&#x6B64;&#x9009;&#x9879;&#xFF0C;&#x5219;&#x6269;&#x5C55;&#x540D;&#x5E94;&#x5305;&#x542B;&#x5728;&#x672A;&#x547D;&#x540D;&#xFF08;&#x9ED8;&#x8BA4;&#xFF09;&#x90E8;&#x5206;&#x4E2D;&#xFF0C;&#x9ED8;&#x8BA4;&#x90E8;&#x5206;&#x5E94;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;&ldquo;extensions&rdquo;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x8BE5;&#x53D8;&#x91CF;&#x5305;&#x542B;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x90E8;&#x5206;&#x3002; &#x6709;&#x5173;&#x6269;&#x5C55;&#x90E8;&#x5206;&#x683C;&#x5F0F;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;x509v3_config&#xFF08;5&#xFF09;&#x624B;&#x518C;&#x9875;&#x3002;</p>

</dd>
<dt id="force_pubkey-key"><b>-force_pubkey key</b></dt>
<dd>

<p>when a certificate is created set its public key to <b>key</b> instead of the key in the certificate or certificate request. This option is useful for creating certificates where the algorithm can&#39;t normally sign requests, for example DH.</p>

<p>The format or <b>key</b> can be specified using the <b>-keyform</b> option.</p>

<p>&#x5F53;&#x521B;&#x5EFA;&#x8BC1;&#x4E66;&#x65F6;&#xFF0C;&#x5C06;&#x5176;&#x516C;&#x94A5;&#x8BBE;&#x7F6E;&#x4E3A;key&#x800C;&#x4E0D;&#x662F;&#x8BC1;&#x4E66;&#x6216;&#x8BC1;&#x4E66;&#x8BF7;&#x6C42;&#x4E2D;&#x7684;&#x5BC6;&#x94A5;&#x3002; &#x6B64;&#x9009;&#x9879;&#x5BF9;&#x4E8E;&#x521B;&#x5EFA;&#x8BC1;&#x4E66;&#xFF0C;&#x5728;&#x7B97;&#x6CD5;&#x65E0;&#x6CD5;&#x6B63;&#x5E38;&#x7B7E;&#x7F72;&#x8BF7;&#x6C42;&#x65F6;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x4F8B;&#x5982;DH&#x3002;</p>

<p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;-keyform&#x9009;&#x9879;&#x6307;&#x5B9A;&#x683C;&#x5F0F;&#x6216;key&#x3002;</p>

</dd>
</dl>

<h2 id="Name-Options">Name Options</h2>

<p>The <b>nameopt</b> command line switch determines how the subject and issuer names are displayed. If no <b>nameopt</b> switch is present the default &quot;oneline&quot; format is used which is compatible with previous versions of GmSSL. Each option is described in detail below, all options can be preceded by a <b>-</b> to turn the option off. Only the first four will normally be used.</p>

<p>nameopt&#x547D;&#x4EE4;&#x884C;&#x5F00;&#x5173;&#x786E;&#x5B9A;&#x4E3B;&#x9898;&#x548C;&#x53D1;&#x884C;&#x8005;&#x540D;&#x79F0;&#x7684;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x3002; &#x5982;&#x679C;&#x6CA1;&#x6709;nameopt&#x5F00;&#x5173;&#xFF0C; &#x5219;&#x4F7F;&#x7528;&#x4E0E;&#x4EE5;&#x524D;&#x7248;&#x672C;&#x7684;GmSSL&#x517C;&#x5BB9;&#x7684;&#x9ED8;&#x8BA4;&ldquo;oneline&rdquo;&#x683C;&#x5F0F;&#x3002; &#x6BCF;&#x4E2A;&#x9009;&#x9879;&#x5728;&#x4E0B;&#x9762;&#x8BE6;&#x7EC6;&#x63CF;&#x8FF0;&#xFF0C; &#x6240;&#x6709;&#x9009;&#x9879;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x524D;&#x9762; - &#x5173;&#x95ED;&#x8BE5;&#x9009;&#x9879;&#x3002; &#x901A;&#x5E38;&#x53EA;&#x4F1A;&#x4F7F;&#x7528;&#x524D;&#x56DB;&#x4E2A;&#x3002;</p>

<dl>

<dt id="compat"><b>compat</b></dt>
<dd>

<p>use the old format.</p>

<p>&#x4F7F;&#x7528;&#x65E7;&#x7684;&#x683C;&#x5F0F;&#x3002;</p>

</dd>
<dt id="RFC2253"><b>RFC2253</b></dt>
<dd>

<p>displays names compatible with RFC2253 equivalent to <b>esc_2253</b>, <b>esc_ctrl</b>, <b>esc_msb</b>, <b>utf8</b>, <b>dump_nostr</b>, <b>dump_unknown</b>, <b>dump_der</b>, <b>sep_comma_plus</b>, <b>dn_rev</b> and <b>sname</b>.</p>

<p>&#x663E;&#x793A;&#x4E0E;esc2253&#xFF0C;esc_ctrl&#xFF0C;esc_msb&#xFF0C;utf8&#xFF0C;dump_nostr&#xFF0C;dump_unknown&#xFF0C;dump_der&#xFF0C;sep_comma_plus&#xFF0C; dn_rev&#x548C;sname&#x7B49;&#x6548;&#x7684;RFC2253&#x517C;&#x5BB9;&#x7684;&#x540D;&#x79F0;&#x3002;</p>

</dd>
<dt id="oneline"><b>oneline</b></dt>
<dd>

<p>a oneline format which is more readable than RFC2253. It is equivalent to specifying the <b>esc_2253</b>, <b>esc_ctrl</b>, <b>esc_msb</b>, <b>utf8</b>, <b>dump_nostr</b>, <b>dump_der</b>, <b>use_quote</b>, <b>sep_comma_plus_space</b>, <b>space_eq</b> and <b>sname</b> options. This is the <i>default</i> of no name options are given explicitly.</p>

<p>&#x4E00;&#x79CD;&#x6BD4;RFC2253&#x66F4;&#x53EF;&#x8BFB;&#x7684;&#x5728;&#x7EBF;&#x683C;&#x5F0F;&#x3002; &#x76F8;&#x5F53;&#x4E8E;&#x6307;&#x5B9A;esc_2253&#xFF0C;esc_ctrl&#xFF0C;esc_msb&#xFF0C;utf8&#xFF0C;dump_nostr&#xFF0C; dump_der&#xFF0C;use_quote&#xFF0C;sep_comma_plus_space&#xFF0C;space_eq&#x548C;sname&#x9009;&#x9879;&#x3002; &#x8FD9;&#x662F;&#x9ED8;&#x8BA4;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x7ED9;&#x51FA;&#x540D;&#x79F0;&#x9009;&#x9879;&#x3002;</p>

</dd>
<dt id="multiline"><b>multiline</b></dt>
<dd>

<p>a multiline format. It is equivalent <b>esc_ctrl</b>, <b>esc_msb</b>, <b>sep_multiline</b>, <b>space_eq</b>, <b>lname</b> and <b>align</b>.</p>

<p>&#x591A;&#x884C;&#x683C;&#x5F0F;&#x3002; &#x5B83;&#x7B49;&#x6548;&#x4E8E;esc_ctrl&#xFF0C;esc_msb&#xFF0C;sep_multiline&#xFF0C;space_eq&#xFF0C;lname&#x548C;align&#x3002;</p>

</dd>
<dt id="esc_2253"><b>esc_2253</b></dt>
<dd>

<p>escape the &quot;special&quot; characters required by RFC2253 in a field. That is <b>,+&quot;&lt;&gt;;</b>. Additionally <b>#</b> is escaped at the beginning of a string and a space character at the beginning or end of a string.</p>

<p>&#x5728;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x4E2D;&#x8F6C;&#x4E49;RFC2253&#x6240;&#x9700;&#x7684;&ldquo;&#x7279;&#x6B8A;&rdquo;&#x5B57;&#x7B26;&#x3002; &#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;+&ldquo;&lt;&gt;;&#x53E6;&#x5916;&#xFF03;&#x5728;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5F00;&#x59CB;&#x5904;&#x8F6C;&#x4E49;&#xFF0C;&#x5728;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5F00;&#x5934;&#x6216;&#x7ED3;&#x5C3E;&#x653E;&#x7F6E;&#x4E00;&#x4E2A;&#x7A7A;&#x683C;&#x3002;</p>

</dd>
<dt id="esc_2254"><b>esc_2254</b></dt>
<dd>

<p>escape the &quot;special&quot; characters required by RFC2254 in a field. That is the <b>NUL</b> character as well as and <b>()*</b>.</p>

<p>&#x5728;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x4E2D;&#x8F6C;&#x4E49;RFC2254&#x6240;&#x9700;&#x7684;&ldquo;&#x7279;&#x6B8A;&rdquo;&#x5B57;&#x7B26;&#x3002; &#x90A3;&#x5C31;&#x662F;NUL&#x5B57;&#x7B26;&#x4EE5;&#x53CA;&#xFF08;&#xFF09;*&#x3002;</p>

</dd>
<dt id="esc_ctrl"><b>esc_ctrl</b></dt>
<dd>

<p>escape control characters. That is those with ASCII values less than 0x20 (space) and the delete (0x7f) character. They are escaped using the RFC2253 \XX notation (where XX are two hex digits representing the character value).</p>

<p>&#x8F6C;&#x4E49;&#x63A7;&#x5236;&#x5B57;&#x7B26;&#x3002; &#x90A3;&#x662F;ASCII&#x503C;&#x5C0F;&#x4E8E;0x20&#xFF08;&#x7A7A;&#x683C;&#xFF09;&#x548C;&#x5220;&#x9664;&#xFF08;0x7f&#xFF09;&#x5B57;&#x7B26;&#x7684;&#x90A3;&#x4E9B;&#x3002; &#x5B83;&#x4EEC;&#x4F7F;&#x7528;RFC2253 \ XX&#x7B26;&#x53F7;&#x8FDB;&#x884C;&#x8F6C;&#x4E49;&#xFF08;&#x5176;&#x4E2D;XX&#x662F;&#x8868;&#x793A;&#x5B57;&#x7B26;&#x503C;&#x7684;&#x4E24;&#x4E2A;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#xFF09;&#x3002;</p>

</dd>
<dt id="esc_msb"><b>esc_msb</b></dt>
<dd>

<p>escape characters with the MSB set, that is with ASCII values larger than 127.</p>

<p>&#x8F6C;&#x4E49;&#x5B57;&#x7B26;&#x4E0E;MSB&#x96C6;&#x5408;&#xFF0C;&#x5373;ASCII&#x503C;&#x5927;&#x4E8E;127&#x3002;</p>

</dd>
<dt id="use_quote"><b>use_quote</b></dt>
<dd>

<p>escapes some characters by surrounding the whole string with <b>&quot;</b> characters, without the option all escaping is done with the <b>\</b> character.</p>

<p>&#x901A;&#x8FC7;&#x56F4;&#x7ED5;&#x6574;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x4EE5;&ldquo;&#x5B57;&#x7B26;&rdquo;&#x8F6C;&#x4E49;&#x4E00;&#x4E9B;&#x5B57;&#x7B26;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x9009;&#x9879;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8F6C;&#x4E49;&#x90FD;&#x662F;&#x7528;\&#x5B57;&#x7B26;&#x5B8C;&#x6210;&#x7684;&#x3002;</p>

</dd>
<dt id="utf8"><b>utf8</b></dt>
<dd>

<p>convert all strings to UTF8 format first. This is required by RFC2253. If you are lucky enough to have a UTF8 compatible terminal then the use of this option (and <b>not</b> setting <b>esc_msb</b>) may result in the correct display of multibyte (international) characters. Is this option is not present then multibyte characters larger than 0xff will be represented using the format \UXXXX for 16 bits and \WXXXXXXXX for 32 bits. Also if this option is off any UTF8Strings will be converted to their character form first.</p>

<p>&#x9996;&#x5148;&#x5C06;&#x6240;&#x6709;&#x5B57;&#x7B26;&#x4E32;&#x8F6C;&#x6362;&#x4E3A;UTF8&#x683C;&#x5F0F;&#x3002; &#x8FD9;&#x662F;RFC2253&#x6240;&#x8981;&#x6C42;&#x7684;&#x3002; &#x5982;&#x679C;&#x60A8;&#x8DB3;&#x591F;&#x6709;&#x8DB3;&#x591F;&#x7684;UTF8&#x517C;&#x5BB9;&#x7EC8;&#x7AEF;&#xFF0C; &#x5219;&#x4F7F;&#x7528;&#x6B64;&#x9009;&#x9879;&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x8BBE;&#x7F6E;esc_msb&#xFF09;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x591A;&#x5B57;&#x8282;&#xFF08;&#x56FD;&#x9645;&#xFF09;&#x5B57;&#x7B26;&#x7684;&#x6B63;&#x786E;&#x663E;&#x793A;&#x3002; &#x6B64;&#x9009;&#x9879;&#x4E0D;&#x5B58;&#x5728;&#xFF0C; &#x5219;&#x5927;&#x4E8E;0xff&#x7684;&#x591A;&#x5B57;&#x8282;&#x5B57;&#x7B26;&#x5C06;&#x4F7F;&#x7528;&#x683C;&#x5F0F;\ UXXXX&#xFF08;16&#x4F4D;&#xFF09;&#x548C;\ WXXXXXXXX&#xFF08;32&#x4F4D;&#xFF09;&#x6765;&#x8868;&#x793A;&#x3002; &#x6B64;&#x5916;&#xFF0C; &#x5982;&#x679C;&#x6B64;&#x9009;&#x9879;&#x5173;&#x95ED;&#xFF0C;&#x4EFB;&#x4F55;UTF8Strings&#x5C06;&#x9996;&#x5148;&#x8F6C;&#x6362;&#x4E3A;&#x5176;&#x5B57;&#x7B26;&#x5F62;&#x5F0F;&#x3002;</p>

</dd>
<dt id="ignore_type"><b>ignore_type</b></dt>
<dd>

<p>this option does not attempt to interpret multibyte characters in any way. That is their content octets are merely dumped as though one octet represents each character. This is useful for diagnostic purposes but will result in rather odd looking output.</p>

<p>&#x6B64;&#x9009;&#x9879;&#x4E0D;&#x4F1A;&#x4EE5;&#x4EFB;&#x4F55;&#x65B9;&#x5F0F;&#x5C1D;&#x8BD5;&#x89E3;&#x91CA;&#x591A;&#x5B57;&#x8282;&#x5B57;&#x7B26;&#x3002; &#x8FD9;&#x5C31;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x5185;&#x5BB9;&#x516B;&#x4F4D;&#x5B57;&#x8282;&#x53EA;&#x662F;&#x88AB;&#x8F6C;&#x50A8;&#xFF0C; &#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x516B;&#x4F4D;&#x4F4D;&#x7EC4;&#x4EE3;&#x8868;&#x6BCF;&#x4E2A;&#x5B57;&#x7B26;&#x4E00;&#x6837;&#x3002; &#x8FD9;&#x5BF9;&#x4E8E;&#x8BCA;&#x65AD;&#x76EE;&#x7684;&#x662F;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x4F46;&#x4F1A;&#x5BFC;&#x81F4;&#x76F8;&#x5F53;&#x5947;&#x602A;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>

</dd>
<dt id="show_type"><b>show_type</b></dt>
<dd>

<p>show the type of the ASN1 character string. The type precedes the field contents. For example &quot;BMPSTRING: Hello World&quot;.</p>

<p>&#x663E;&#x793A;ASN1&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x7C7B;&#x578B;&#x3002; &#x8BE5;&#x7C7B;&#x578B;&#x4F4D;&#x4E8E;&#x5B57;&#x6BB5;&#x5185;&#x5BB9;&#x4E4B;&#x524D;&#x3002; &#x4F8B;&#x5982;&ldquo;BMPSTRING&#xFF1A;Hello World&rdquo;&#x3002;</p>

</dd>
<dt id="dump_der"><b>dump_der</b></dt>
<dd>

<p>when this option is set any fields that need to be hexdumped will be dumped using the DER encoding of the field. Otherwise just the content octets will be displayed. Both options use the RFC2253 <b>#XXXX...</b> format.</p>

<p>&#x5F53;&#x8BBE;&#x7F6E;&#x6B64;&#x9009;&#x9879;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x4F7F;&#x7528;hexdumped&#x7684;&#x4EFB;&#x4F55;&#x5B57;&#x6BB5;&#x5C06;&#x4F7F;&#x7528;&#x5B57;&#x6BB5;&#x7684;DER&#x7F16;&#x7801;&#x8FDB;&#x884C;&#x8F6C;&#x50A8;&#x3002; &#x5426;&#x5219;&#x53EA;&#x4F1A;&#x663E;&#x793A;&#x5185;&#x5BB9;&#x516B;&#x4F4D;&#x5B57;&#x8282;&#x3002; &#x4E24;&#x79CD;&#x9009;&#x9879;&#x90FD;&#x4F7F;&#x7528;RFC2253 #XXXX ...&#x683C;&#x5F0F;</p>

</dd>
<dt id="dump_nostr"><b>dump_nostr</b></dt>
<dd>

<p>dump non character string types (for example OCTET STRING) if this option is not set then non character string types will be displayed as though each content octet represents a single character.</p>

<p>&#x8F6C;&#x50A8;&#x975E;&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#xFF08;&#x4F8B;&#x5982;OCTET STRING&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x672A;&#x8BBE;&#x7F6E;&#x6B64;&#x9009;&#x9879;&#xFF0C; &#x5219;&#x5C06;&#x663E;&#x793A;&#x975E;&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x5185;&#x5BB9;&#x5B57;&#x8282;&#x8868;&#x793A;&#x5355;&#x4E2A;&#x5B57;&#x7B26;&#x3002;</p>

</dd>
<dt id="dump_all"><b>dump_all</b></dt>
<dd>

<p>dump all fields. This option when used with <b>dump_der</b> allows the DER encoding of the structure to be unambiguously determined.</p>

<p>&#x8F6C;&#x50A8;&#x6240;&#x6709;&#x5B57;&#x6BB5;&#x3002; &#x5F53;&#x4E0E;dump_der&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x8BE5;&#x9009;&#x9879;&#x5141;&#x8BB8;&#x660E;&#x786E;&#x5730;&#x786E;&#x5B9A;&#x7ED3;&#x6784;&#x7684;DER&#x7F16;&#x7801;&#x3002;</p>

</dd>
<dt id="dump_unknown"><b>dump_unknown</b></dt>
<dd>

<p>dump any field whose OID is not recognised by GmSSL.</p>

<p>&#x8F6C;&#x50A8;GmSSL&#x4E0D;&#x8BC6;&#x522B;&#x5176;OID&#x7684;&#x4EFB;&#x4F55;&#x5B57;&#x6BB5;&#x3002;</p>

</dd>
<dt id="sep_comma_plus-sep_comma_plus_space-sep_semi_plus_space-sep_multiline"><b>sep_comma_plus</b>, <b>sep_comma_plus_space</b>, <b>sep_semi_plus_space</b>, <b>sep_multiline</b></dt>
<dd>

<p>these options determine the field separators. The first character is between RDNs and the second between multiple AVAs (multiple AVAs are very rare and their use is discouraged). The options ending in &quot;space&quot; additionally place a space after the separator to make it more readable. The <b>sep_multiline</b> uses a linefeed character for the RDN separator and a spaced <b>+</b> for the AVA separator. It also indents the fields by four characters. If no field separator is specified then <b>sep_comma_plus_space</b> is used by default.</p>

<p>&#x8FD9;&#x4E9B;&#x9009;&#x9879;&#x51B3;&#x5B9A;&#x4E86;&#x5B57;&#x6BB5;&#x5206;&#x9694;&#x7B26;&#x3002; &#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x5728;RDN&#x4E4B;&#x95F4;&#xFF0C;&#x800C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x591A;&#x4E2A;AVA&#x4E4B;&#x95F4;&#xFF08;&#x591A;&#x4E2A;AVA&#x975E;&#x5E38;&#x7F55;&#x89C1;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x9F13;&#x52B1;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#xFF09;&#x3002; &#x4EE5;&ldquo;&#x7A7A;&#x683C;&rdquo;&#x7ED3;&#x5C3E;&#x7684;&#x9009;&#x9879;&#x8FD8;&#x4F1A;&#x5728;&#x5206;&#x9694;&#x7B26;&#x4E4B;&#x540E;&#x653E;&#x7F6E;&#x4E00;&#x4E2A;&#x7A7A;&#x683C;&#xFF0C;&#x4F7F;&#x5176;&#x66F4;&#x6613;&#x4E8E;&#x9605;&#x8BFB;&#x3002; sep_multiline&#x5BF9;RDN&#x5206;&#x9694;&#x7B26;&#x4F7F;&#x7528;&#x6362;&#x884C;&#x5B57;&#x7B26;&#xFF0C; &#x5E76;&#x4E3A;AVA&#x5206;&#x9694;&#x7B26;&#x4F7F;&#x7528;&#x95F4;&#x9694;&#x7684;+&#x3002; &#x5B83;&#x8FD8;&#x5C06;&#x5B57;&#x6BB5;&#x7F29;&#x5C0F;&#x56DB;&#x4E2A;&#x5B57;&#x7B26;&#x3002; &#x5982;&#x679C;&#x6CA1;&#x6709;&#x6307;&#x5B9A;&#x5B57;&#x6BB5;&#x5206;&#x9694;&#x7B26;&#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x4F7F;&#x7528;sep_comma_plus_space&#x3002;</p>

</dd>
<dt id="dn_rev"><b>dn_rev</b></dt>
<dd>

<p>reverse the fields of the DN. This is required by RFC2253. As a side effect this also reverses the order of multiple AVAs but this is permissible.</p>

<p>&#x53CD;&#x8F6C;DN&#x7684;&#x5B57;&#x6BB5;&#x3002; &#x8FD9;&#x662F;RFC2253&#x6240;&#x8981;&#x6C42;&#x7684;&#x3002; &#x4F5C;&#x4E3A;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x8FD9;&#x4E5F;&#x53CD;&#x8F6C;&#x4E86;&#x591A;&#x4E2A;AVA&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x4F46;&#x8FD9;&#x662F;&#x5141;&#x8BB8;&#x7684;&#x3002;</p>

</dd>
<dt id="nofname-sname-lname-oid"><b>nofname</b>, <b>sname</b>, <b>lname</b>, <b>oid</b></dt>
<dd>

<p>these options alter how the field name is displayed. <b>nofname</b> does not display the field at all. <b>sname</b> uses the &quot;short name&quot; form (CN for commonName for example). <b>lname</b> uses the long form. <b>oid</b> represents the OID in numerical form and is useful for diagnostic purpose.</p>

<p>&#x8FD9;&#x4E9B;&#x9009;&#x9879;&#x4F1A;&#x6539;&#x53D8;&#x5B57;&#x6BB5;&#x540D;&#x79F0;&#x7684;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x3002; nofname&#x6839;&#x672C;&#x4E0D;&#x663E;&#x793A;&#x5B57;&#x6BB5;&#x3002; sname&#x4F7F;&#x7528;&ldquo;&#x77ED;&#x540D;&#x79F0;&rdquo;&#x8868;&#x5355;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x7528;&#x4E8E;commonName&#x7684;CN&#xFF09;&#x3002; lname&#x4F7F;&#x7528;&#x957F;&#x683C;&#x5F0F;&#x3002; oid&#x4EE5;&#x6570;&#x5B57;&#x5F62;&#x5F0F;&#x8868;&#x793A;OID&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x8BCA;&#x65AD;&#x76EE;&#x7684;&#x3002;</p>

</dd>
<dt id="align"><b>align</b></dt>
<dd>

<p>align field values for a more readable output. Only usable with <b>sep_multiline</b>.</p>

<p>&#x8C03;&#x6574;&#x5B57;&#x6BB5;&#x503C;&#x4EE5;&#x83B7;&#x5F97;&#x66F4;&#x53EF;&#x8BFB;&#x7684;&#x8F93;&#x51FA;&#x3002; &#x4EC5;&#x9002;&#x7528;&#x4E8E;sep_multiline&#x3002;</p>

</dd>
<dt id="space_eq"><b>space_eq</b></dt>
<dd>

<p>places spaces round the <b>=</b> character which follows the field name.</p>

<p>&#x5728;&#x5B57;&#x6BB5;&#x540D;&#x540E;&#x9762;&#x7684;=&#x5B57;&#x7B26;&#x4E0A;&#x653E;&#x7F6E;&#x7A7A;&#x683C;&#x3002;</p>

</dd>
</dl>

<h2 id="Text-Options">Text Options</h2>

<p>As well as customising the name output format, it is also possible to customise the actual fields printed using the <b>certopt</b> options when the <b>text</b> option is present. The default behaviour is to print all fields.</p>

<dl>

<dt id="compatible"><b>compatible</b></dt>
<dd>

<p>use the old format. This is equivalent to specifying no output options at all.</p>

</dd>
<dt id="no_header"><b>no_header</b></dt>
<dd>

<p>don&#39;t print header information: that is the lines saying &quot;Certificate&quot; and &quot;Data&quot;.</p>

</dd>
<dt id="no_version"><b>no_version</b></dt>
<dd>

<p>don&#39;t print out the version number.</p>

</dd>
<dt id="no_serial"><b>no_serial</b></dt>
<dd>

<p>don&#39;t print out the serial number.</p>

</dd>
<dt id="no_signame"><b>no_signame</b></dt>
<dd>

<p>don&#39;t print out the signature algorithm used.</p>

</dd>
<dt id="no_validity"><b>no_validity</b></dt>
<dd>

<p>don&#39;t print the validity, that is the <b>notBefore</b> and <b>notAfter</b> fields.</p>

</dd>
<dt id="no_subject"><b>no_subject</b></dt>
<dd>

<p>don&#39;t print out the subject name.</p>

</dd>
<dt id="no_issuer"><b>no_issuer</b></dt>
<dd>

<p>don&#39;t print out the issuer name.</p>

</dd>
<dt id="no_pubkey"><b>no_pubkey</b></dt>
<dd>

<p>don&#39;t print out the public key.</p>

</dd>
<dt id="no_sigdump"><b>no_sigdump</b></dt>
<dd>

<p>don&#39;t give a hexadecimal dump of the certificate signature.</p>

</dd>
<dt id="no_aux"><b>no_aux</b></dt>
<dd>

<p>don&#39;t print out certificate trust information.</p>

</dd>
<dt id="no_extensions"><b>no_extensions</b></dt>
<dd>

<p>don&#39;t print out any X509V3 extensions.</p>

</dd>
<dt id="ext_default"><b>ext_default</b></dt>
<dd>

<p>retain default extension behaviour: attempt to print out unsupported certificate extensions.</p>

</dd>
<dt id="ext_error"><b>ext_error</b></dt>
<dd>

<p>print an error message for unsupported certificate extensions.</p>

</dd>
<dt id="ext_parse"><b>ext_parse</b></dt>
<dd>

<p>ASN1 parse unsupported extensions.</p>

</dd>
<dt id="ext_dump"><b>ext_dump</b></dt>
<dd>

<p>hex dump unsupported extensions.</p>

</dd>
<dt id="ca_default"><b>ca_default</b></dt>
<dd>

<p>the value used by the <b>ca</b> utility, equivalent to <b>no_issuer</b>, <b>no_pubkey</b>, <b>no_header</b>, and <b>no_version</b>.</p>

</dd>
</dl>

<h1 id="EXAMPLES">EXAMPLES</h1>

<p>Note: in these examples the &#39;\&#39; means the example should be all on one line.</p>

<p>Display the contents of a certificate:</p>

<pre><code> gmssl x509 -in cert.pem -noout -text</code></pre>

<p>Display the certificate serial number:</p>

<pre><code> gmssl x509 -in cert.pem -noout -serial</code></pre>

<p>Display the certificate subject name:</p>

<pre><code> gmssl x509 -in cert.pem -noout -subject</code></pre>

<p>Display the certificate subject name in RFC2253 form:</p>

<pre><code> gmssl x509 -in cert.pem -noout -subject -nameopt RFC2253</code></pre>

<p>Display the certificate subject name in oneline form on a terminal supporting UTF8:</p>

<pre><code> gmssl x509 -in cert.pem -noout -subject -nameopt oneline,-esc_msb</code></pre>

<p>Display the certificate MD5 fingerprint:</p>

<pre><code> gmssl x509 -in cert.pem -noout -fingerprint</code></pre>

<p>Display the certificate SHA1 fingerprint:</p>

<pre><code> gmssl x509 -sha1 -in cert.pem -noout -fingerprint</code></pre>

<p>Convert a certificate from PEM to DER format:</p>

<pre><code> gmssl x509 -in cert.pem -inform PEM -out cert.der -outform DER</code></pre>

<p>Convert a certificate to a certificate request:</p>

<pre><code> gmssl x509 -x509toreq -in cert.pem -out req.pem -signkey key.pem</code></pre>

<p>Convert a certificate request into a self signed certificate using extensions for a CA:</p>

<pre><code> gmssl x509 -req -in careq.pem -extfile openssl.cnf -extensions v3_ca \
        -signkey key.pem -out cacert.pem</code></pre>

<p>Sign a certificate request using the CA certificate above and add user certificate extensions:</p>

<pre><code> gmssl x509 -req -in req.pem -extfile openssl.cnf -extensions v3_usr \
        -CA cacert.pem -CAkey key.pem -CAcreateserial</code></pre>

<p>Set a certificate to be trusted for SSL client use and change set its alias to &quot;Steve&#39;s Class 1 CA&quot;</p>

<pre><code> gmssl x509 -in cert.pem -addtrust clientAuth \
        -setalias &quot;Steve&#39;s Class 1 CA&quot; -out trust.pem</code></pre>

<h1 id="NOTES">NOTES</h1>

<p>The PEM format uses the header and footer lines:</p>

<pre><code> -----BEGIN CERTIFICATE-----
 -----END CERTIFICATE-----</code></pre>

<p>it will also handle files containing:</p>

<pre><code> -----BEGIN X509 CERTIFICATE-----
 -----END X509 CERTIFICATE-----</code></pre>

<p>Trusted certificates have the lines</p>

<pre><code> -----BEGIN TRUSTED CERTIFICATE-----
 -----END TRUSTED CERTIFICATE-----</code></pre>

<p>The conversion to UTF8 format used with the name options assumes that T61Strings use the ISO8859-1 character set. This is wrong but Netscape and MSIE do this as do many certificates. So although this is incorrect it is more likely to display the majority of certificates correctly.</p>

<p>The <b>-fingerprint</b> option takes the digest of the DER encoded certificate. This is commonly called a &quot;fingerprint&quot;. Because of the nature of message digests the fingerprint of a certificate is unique to that certificate and two certificates with the same fingerprint can be considered to be the same.</p>

<p>The Netscape fingerprint uses MD5 whereas MSIE uses SHA1.</p>

<p>The <b>-email</b> option searches the subject name and the subject alternative name extension. Only unique email addresses will be printed out: it will not print the same address more than once.</p>

<h1 id="CERTIFICATE-EXTENSIONS">CERTIFICATE EXTENSIONS</h1>

<p>The <b>-purpose</b> option checks the certificate extensions and determines what the certificate can be used for. The actual checks done are rather complex and include various hacks and workarounds to handle broken certificates and software.</p>

<p>The same code is used when verifying untrusted certificates in chains so this section is useful if a chain is rejected by the verify code.</p>

<p>The basicConstraints extension CA flag is used to determine whether the certificate can be used as a CA. If the CA flag is true then it is a CA, if the CA flag is false then it is not a CA. <b>All</b> CAs should have the CA flag set to true.</p>

<p>If the basicConstraints extension is absent then the certificate is considered to be a &quot;possible CA&quot; other extensions are checked according to the intended use of the certificate. A warning is given in this case because the certificate should really not be regarded as a CA: however it is allowed to be a CA to work around some broken software.</p>

<p>If the certificate is a V1 certificate (and thus has no extensions) and it is self signed it is also assumed to be a CA but a warning is again given: this is to work around the problem of Verisign roots which are V1 self signed certificates.</p>

<p>If the keyUsage extension is present then additional restraints are made on the uses of the certificate. A CA certificate <b>must</b> have the keyCertSign bit set if the keyUsage extension is present.</p>

<p>The extended key usage extension places additional restrictions on the certificate uses. If this extension is present (whether critical or not) the key can only be used for the purposes specified.</p>

<p>A complete description of each test is given below. The comments about basicConstraints and keyUsage and V1 certificates above apply to <b>all</b> CA certificates.</p>

<dl>

<dt id="SSL-Client"><b>SSL Client</b></dt>
<dd>

<p>The extended key usage extension must be absent or include the &quot;web client authentication&quot; OID. keyUsage must be absent or it must have the digitalSignature bit set. Netscape certificate type must be absent or it must have the SSL client bit set.</p>

</dd>
<dt id="SSL-Client-CA"><b>SSL Client CA</b></dt>
<dd>

<p>The extended key usage extension must be absent or include the &quot;web client authentication&quot; OID. Netscape certificate type must be absent or it must have the SSL CA bit set: this is used as a work around if the basicConstraints extension is absent.</p>

</dd>
<dt id="SSL-Server"><b>SSL Server</b></dt>
<dd>

<p>The extended key usage extension must be absent or include the &quot;web server authentication&quot; and/or one of the SGC OIDs. keyUsage must be absent or it must have the digitalSignature, the keyEncipherment set or both bits set. Netscape certificate type must be absent or have the SSL server bit set.</p>

</dd>
<dt id="SSL-Server-CA"><b>SSL Server CA</b></dt>
<dd>

<p>The extended key usage extension must be absent or include the &quot;web server authentication&quot; and/or one of the SGC OIDs. Netscape certificate type must be absent or the SSL CA bit must be set: this is used as a work around if the basicConstraints extension is absent.</p>

</dd>
<dt id="Netscape-SSL-Server"><b>Netscape SSL Server</b></dt>
<dd>

<p>For Netscape SSL clients to connect to an SSL server it must have the keyEncipherment bit set if the keyUsage extension is present. This isn&#39;t always valid because some cipher suites use the key for digital signing. Otherwise it is the same as a normal SSL server.</p>

</dd>
<dt id="Common-S-MIME-Client-Tests"><b>Common S/MIME Client Tests</b></dt>
<dd>

<p>The extended key usage extension must be absent or include the &quot;email protection&quot; OID. Netscape certificate type must be absent or should have the S/MIME bit set. If the S/MIME bit is not set in Netscape certificate type then the SSL client bit is tolerated as an alternative but a warning is shown: this is because some Verisign certificates don&#39;t set the S/MIME bit.</p>

</dd>
<dt id="S-MIME-Signing"><b>S/MIME Signing</b></dt>
<dd>

<p>In addition to the common S/MIME client tests the digitalSignature bit must be set if the keyUsage extension is present.</p>

</dd>
<dt id="S-MIME-Encryption"><b>S/MIME Encryption</b></dt>
<dd>

<p>In addition to the common S/MIME tests the keyEncipherment bit must be set if the keyUsage extension is present.</p>

</dd>
<dt id="S-MIME-CA"><b>S/MIME CA</b></dt>
<dd>

<p>The extended key usage extension must be absent or include the &quot;email protection&quot; OID. Netscape certificate type must be absent or must have the S/MIME CA bit set: this is used as a work around if the basicConstraints extension is absent.</p>

</dd>
<dt id="CRL-Signing"><b>CRL Signing</b></dt>
<dd>

<p>The keyUsage extension must be absent or it must have the CRL signing bit set.</p>

</dd>
<dt id="CRL-Signing-CA"><b>CRL Signing CA</b></dt>
<dd>

<p>The normal CA tests apply. Except in this case the basicConstraints extension must be present.</p>

</dd>
</dl>

<h1 id="BUGS">BUGS</h1>

<p>Extensions in certificates are not transferred to certificate requests and vice versa.</p>

<p>It is possible to produce invalid certificates or requests by specifying the wrong private key or using inconsistent options in some cases: these should be checked.</p>

<p>There should be options to explicitly set such things as start and end dates rather than an offset from the current time.</p>

<h1 id="SEE-ALSO">SEE ALSO</h1>

<p><a href="../man1/req">req(1)</a>, <a href="../man1/ca">ca(1)</a>, <a href="../man1/genrsa">genrsa(1)</a>, <a href="../man1/gendsa">gendsa(1)</a>, <a href="../man1/verify">verify(1)</a>, <a href="../man5/x509v3_config.html">x509v3_config(5)</a></p>

<h1 id="HISTORY">HISTORY</h1>

<p>The hash algorithm used in the <b>-subject_hash</b> and <b>-issuer_hash</b> options before GmSSL 1.0.0 was based on the deprecated MD5 algorithm and the encoding of the distinguished name. In GmSSL 1.0.0 and later it is based on a canonical version of the DN using SHA1. This means that any directories using the old form must have their links rebuilt using <b>c_rehash</b> or similar.</p>

<h1 id="COPYRIGHT">COPYRIGHT</h1>

<p>Copyright 2000-2016 The OpenSSL Project Authors. All Rights Reserved.</p>

<p>Licensed under the GmSSL license (the &quot;License&quot;). You may not use this file except in compliance with the License. You can obtain a copy in the file LICENSE in the source distribution or at <a href="https://www.openssl.org/source/license.html">https://www.openssl.org/source/license.html</a>.</p>


</body>

</html>


